@sethvargo yes, confirming it was a brand new GCP project. For me, `terraform apply` fails in one go. 

Here are the steps and console output for the very 1st go for a new GCP project (`cw-en-verification-9`):

```
zsombor@MacBook-Pro cw-en-verification-9 % git status
On branch master
nothing to commit, working tree clean
zsombor@MacBook-Pro cw-en-verification-9 % gsutil mb -p ${PROJECT_ID} gs://${PROJECT_ID}-terraform
Creating gs://cw-en-verification-9-terraform/...
zsombor@MacBook-Pro cw-en-verification-9 % terraform init
Initializing modules...
Downloading github.com/google/exposure-notifications-verification-server/terraform for en...
- en in .terraform/modules/en/terraform

Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/random versions matching "~> 2.3, ~> 2.3"...
- Finding hashicorp/google versions matching "~> 3.37, ~> 3.37"...
- Finding hashicorp/google-beta versions matching "~> 3.37, ~> 3.37"...
- Finding hashicorp/local versions matching "~> 1.4, ~> 1.4"...
- Finding hashicorp/null versions matching "~> 2.1, ~> 2.1"...
- Installing hashicorp/local v1.4.0...
- Installed hashicorp/local v1.4.0 (signed by HashiCorp)
- Installing hashicorp/null v2.1.2...
- Installed hashicorp/null v2.1.2 (signed by HashiCorp)
- Installing hashicorp/random v2.3.0...
- Installed hashicorp/random v2.3.0 (signed by HashiCorp)
- Installing hashicorp/google v3.38.0...
- Installed hashicorp/google v3.38.0 (signed by HashiCorp)
- Installing hashicorp/google-beta v3.38.0...
- Installed hashicorp/google-beta v3.38.0 (signed by HashiCorp)

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
zsombor@MacBook-Pro cw-en-verification-9 % terraform apply
module.en.data.google_project.project: Refreshing state...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.en.data.google_firebase_web_app_config.default will be read during apply
  # (config refers to values not yet known)
 <= data "google_firebase_web_app_config" "default"  {
      + api_key             = (known after apply)
      + auth_domain         = (known after apply)
      + database_url        = (known after apply)
      + id                  = (known after apply)
      + location_id         = (known after apply)
      + measurement_id      = (known after apply)
      + messaging_sender_id = (known after apply)
      + storage_bucket      = (known after apply)
      + web_app_id          = (known after apply)
    }

  # module.en.data.google_kms_crypto_key_version.certificate-signer-version will be read during apply
  # (config refers to values not yet known)
 <= data "google_kms_crypto_key_version" "certificate-signer-version"  {
      + algorithm        = (known after apply)
      + crypto_key       = (known after apply)
      + id               = (known after apply)
      + protection_level = (known after apply)
      + public_key       = (known after apply)
      + state            = (known after apply)
    }

  # module.en.data.google_kms_crypto_key_version.token-signer-version will be read during apply
  # (config refers to values not yet known)
 <= data "google_kms_crypto_key_version" "token-signer-version"  {
      + algorithm        = (known after apply)
      + crypto_key       = (known after apply)
      + id               = (known after apply)
      + protection_level = (known after apply)
      + public_key       = (known after apply)
      + state            = (known after apply)
    }

  # module.en.google_app_engine_application.app will be created
  + resource "google_app_engine_application" "app" {
      + app_id            = (known after apply)
      + auth_domain       = (known after apply)
      + code_bucket       = (known after apply)
      + database_type     = (known after apply)
      + default_bucket    = (known after apply)
      + default_hostname  = (known after apply)
      + gcr_domain        = (known after apply)
      + id                = (known after apply)
      + location_id       = "us-central"
      + name              = (known after apply)
      + project           = "cw-en-verification-9"
      + serving_status    = (known after apply)
      + url_dispatch_rule = (known after apply)

      + feature_settings {
          + split_health_checks = (known after apply)
        }

      + iap {
          + enabled                     = (known after apply)
          + oauth2_client_id            = (known after apply)
          + oauth2_client_secret        = (sensitive value)
          + oauth2_client_secret_sha256 = (sensitive value)
        }
    }

  # module.en.google_cloud_run_service.adminapi will be created
  + resource "google_cloud_run_service" "adminapi" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "us-central1"
      + name                       = "adminapi"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = (known after apply)
              + generation       = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = 25

              + containers {
                  + image = "gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/adminapi:initial"

                  + env {
                      + name  = "CACHE_HMAC_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "CACHE_REDIS_HOST"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "CACHE_REDIS_PORT"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "CACHE_TYPE"
                      + value = "REDIS"
                    }
                  + env {
                      + name  = "DB_APIKEY_DATABASE_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_APIKEY_SIGNATURE_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_ENCRYPTION_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_HOST"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_KEY_MANAGER"
                      + value = "GOOGLE_CLOUD_KMS"
                    }
                  + env {
                      + name  = "DB_NAME"
                      + value = "verification"
                    }
                  + env {
                      + name  = "DB_PASSWORD"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_SSLCERT"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_SSLKEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_SSLMODE"
                      + value = "verify-ca"
                    }
                  + env {
                      + name  = "DB_SSLROOTCERT"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_USER"
                      + value = "verification"
                    }
                  + env {
                      + name  = "DB_VERIFICATION_CODE_DATABASE_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "PROJECT_ID"
                      + value = "cw-en-verification-9"
                    }
                  + env {
                      + name  = "RATE_LIMIT_INTERVAL"
                      + value = "1m"
                    }
                  + env {
                      + name  = "RATE_LIMIT_REDIS_HOST"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "RATE_LIMIT_REDIS_PORT"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "RATE_LIMIT_TOKENS"
                      + value = "60"
                    }
                  + env {
                      + name  = "RATE_LIMIT_TYPE"
                      + value = "REDIS"
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1"
                          + "memory" = "512Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
        }
    }

  # module.en.google_cloud_run_service.apiserver will be created
  + resource "google_cloud_run_service" "apiserver" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "us-central1"
      + name                       = "apiserver"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = (known after apply)
              + generation       = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = 25

              + containers {
                  + image = "gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/apiserver:initial"

                  + env {
                      + name  = "CACHE_HMAC_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "CACHE_REDIS_HOST"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "CACHE_REDIS_PORT"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "CACHE_TYPE"
                      + value = "REDIS"
                    }
                  + env {
                      + name  = "CERTIFICATE_KEY_MANAGER"
                      + value = "GOOGLE_CLOUD_KMS"
                    }
                  + env {
                      + name  = "CERTIFICATE_SIGNING_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "CERTIFICATE_SIGNING_KEYRING"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "CSRF_AUTH_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_APIKEY_DATABASE_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_APIKEY_SIGNATURE_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_ENCRYPTION_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_HOST"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_KEY_MANAGER"
                      + value = "GOOGLE_CLOUD_KMS"
                    }
                  + env {
                      + name  = "DB_NAME"
                      + value = "verification"
                    }
                  + env {
                      + name  = "DB_PASSWORD"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_SSLCERT"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_SSLKEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_SSLMODE"
                      + value = "verify-ca"
                    }
                  + env {
                      + name  = "DB_SSLROOTCERT"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_USER"
                      + value = "verification"
                    }
                  + env {
                      + name  = "DB_VERIFICATION_CODE_DATABASE_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_API_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_APP_ID"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_AUTH_DOMAIN"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_DATABASE_URL"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_MEASUREMENT_ID"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_MESSAGE_SENDER_ID"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_PROJECT_ID"
                      + value = "cw-en-verification-9"
                    }
                  + env {
                      + name  = "FIREBASE_STORAGE_BUCKET"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "PROJECT_ID"
                      + value = "cw-en-verification-9"
                    }
                  + env {
                      + name  = "RATE_LIMIT_INTERVAL"
                      + value = "1m"
                    }
                  + env {
                      + name  = "RATE_LIMIT_REDIS_HOST"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "RATE_LIMIT_REDIS_PORT"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "RATE_LIMIT_TOKENS"
                      + value = "60"
                    }
                  + env {
                      + name  = "RATE_LIMIT_TYPE"
                      + value = "REDIS"
                    }
                  + env {
                      + name  = "TOKEN_KEY_MANAGER"
                      + value = "GOOGLE_CLOUD_KMS"
                    }
                  + env {
                      + name  = "TOKEN_SIGNING_KEY"
                      + value = (known after apply)
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1"
                          + "memory" = "512Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
        }
    }

  # module.en.google_cloud_run_service.cleanup will be created
  + resource "google_cloud_run_service" "cleanup" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "us-central1"
      + name                       = "cleanup"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = (known after apply)
              + generation       = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/cleanup:initial"

                  + env {
                      + name  = "CACHE_HMAC_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "CACHE_REDIS_HOST"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "CACHE_REDIS_PORT"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "CACHE_TYPE"
                      + value = "REDIS"
                    }
                  + env {
                      + name  = "CERTIFICATE_KEY_MANAGER"
                      + value = "GOOGLE_CLOUD_KMS"
                    }
                  + env {
                      + name  = "CERTIFICATE_SIGNING_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "CERTIFICATE_SIGNING_KEYRING"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "CSRF_AUTH_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_APIKEY_DATABASE_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_APIKEY_SIGNATURE_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_ENCRYPTION_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_HOST"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_KEY_MANAGER"
                      + value = "GOOGLE_CLOUD_KMS"
                    }
                  + env {
                      + name  = "DB_NAME"
                      + value = "verification"
                    }
                  + env {
                      + name  = "DB_PASSWORD"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_SSLCERT"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_SSLKEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_SSLMODE"
                      + value = "verify-ca"
                    }
                  + env {
                      + name  = "DB_SSLROOTCERT"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_USER"
                      + value = "verification"
                    }
                  + env {
                      + name  = "DB_VERIFICATION_CODE_DATABASE_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_API_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_APP_ID"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_AUTH_DOMAIN"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_DATABASE_URL"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_MEASUREMENT_ID"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_MESSAGE_SENDER_ID"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_PROJECT_ID"
                      + value = "cw-en-verification-9"
                    }
                  + env {
                      + name  = "FIREBASE_STORAGE_BUCKET"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "PROJECT_ID"
                      + value = "cw-en-verification-9"
                    }
                  + env {
                      + name  = "TOKEN_KEY_MANAGER"
                      + value = "GOOGLE_CLOUD_KMS"
                    }
                  + env {
                      + name  = "TOKEN_SIGNING_KEY"
                      + value = (known after apply)
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1"
                          + "memory" = "512Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
        }
    }

  # module.en.google_cloud_run_service.e2e-runner will be created
  + resource "google_cloud_run_service" "e2e-runner" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "us-central1"
      + name                       = "e2e-runner"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = (known after apply)
              + generation       = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/e2e-runner:initial"

                  + env {
                      + name  = "CACHE_HMAC_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "CACHE_REDIS_HOST"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "CACHE_REDIS_PORT"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "CACHE_TYPE"
                      + value = "REDIS"
                    }
                  + env {
                      + name  = "CERTIFICATE_KEY_MANAGER"
                      + value = "GOOGLE_CLOUD_KMS"
                    }
                  + env {
                      + name  = "CERTIFICATE_SIGNING_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "CERTIFICATE_SIGNING_KEYRING"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "CSRF_AUTH_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_APIKEY_DATABASE_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_APIKEY_SIGNATURE_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_ENCRYPTION_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_HOST"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_KEY_MANAGER"
                      + value = "GOOGLE_CLOUD_KMS"
                    }
                  + env {
                      + name  = "DB_NAME"
                      + value = "verification"
                    }
                  + env {
                      + name  = "DB_PASSWORD"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_SSLCERT"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_SSLKEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_SSLMODE"
                      + value = "verify-ca"
                    }
                  + env {
                      + name  = "DB_SSLROOTCERT"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_USER"
                      + value = "verification"
                    }
                  + env {
                      + name  = "DB_VERIFICATION_CODE_DATABASE_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_API_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_APP_ID"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_AUTH_DOMAIN"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_DATABASE_URL"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_MEASUREMENT_ID"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_MESSAGE_SENDER_ID"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_PROJECT_ID"
                      + value = "cw-en-verification-9"
                    }
                  + env {
                      + name  = "FIREBASE_STORAGE_BUCKET"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "HEALTH_AUTHORITY_CODE"
                      + value = "com.example"
                    }
                  + env {
                      + name  = "KEY_SERVER"
                      + value = "https://example.com/v1/publish"
                    }
                  + env {
                      + name  = "PROJECT_ID"
                      + value = "cw-en-verification-9"
                    }
                  + env {
                      + name  = "TOKEN_KEY_MANAGER"
                      + value = "GOOGLE_CLOUD_KMS"
                    }
                  + env {
                      + name  = "TOKEN_SIGNING_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "VERIFICATION_ADMIN_API"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "VERIFICATION_SERVER_API"
                      + value = (known after apply)
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1"
                          + "memory" = "512Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
        }
    }

  # module.en.google_cloud_run_service.server will be created
  + resource "google_cloud_run_service" "server" {
      + autogenerate_revision_name = true
      + id                         = (known after apply)
      + location                   = "us-central1"
      + name                       = "server"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {
          + metadata {
              + annotations      = (known after apply)
              + generation       = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }

          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = 25

              + containers {
                  + image = "gcr.io/cw-en-verification-9/github.com/google/exposure-notifications-verification-server/server:initial"

                  + env {
                      + name  = "ASSETS_PATH"
                      + value = "/assets"
                    }
                  + env {
                      + name  = "CACHE_HMAC_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "CACHE_REDIS_HOST"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "CACHE_REDIS_PORT"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "CACHE_TYPE"
                      + value = "REDIS"
                    }
                  + env {
                      + name  = "CERTIFICATE_KEY_MANAGER"
                      + value = "GOOGLE_CLOUD_KMS"
                    }
                  + env {
                      + name  = "CERTIFICATE_SIGNING_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "CERTIFICATE_SIGNING_KEYRING"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "COOKIE_KEYS"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "CSRF_AUTH_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_APIKEY_DATABASE_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_APIKEY_SIGNATURE_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_ENCRYPTION_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_HOST"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_KEY_MANAGER"
                      + value = "GOOGLE_CLOUD_KMS"
                    }
                  + env {
                      + name  = "DB_NAME"
                      + value = "verification"
                    }
                  + env {
                      + name  = "DB_PASSWORD"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_SSLCERT"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_SSLKEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_SSLMODE"
                      + value = "verify-ca"
                    }
                  + env {
                      + name  = "DB_SSLROOTCERT"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "DB_USER"
                      + value = "verification"
                    }
                  + env {
                      + name  = "DB_VERIFICATION_CODE_DATABASE_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_API_KEY"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_APP_ID"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_AUTH_DOMAIN"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_DATABASE_URL"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_MEASUREMENT_ID"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_MESSAGE_SENDER_ID"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_PRIVACY_POLICY_URL"
                      + value = "https://covidwatch.org/privacy"
                    }
                  + env {
                      + name  = "FIREBASE_PROJECT_ID"
                      + value = "cw-en-verification-9"
                    }
                  + env {
                      + name  = "FIREBASE_STORAGE_BUCKET"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "FIREBASE_TERMS_OF_SERVICE_URL"
                      + value = "https://covidwatch.org/terms"
                    }
                  + env {
                      + name  = "PROJECT_ID"
                      + value = "cw-en-verification-9"
                    }
                  + env {
                      + name  = "RATE_LIMIT_INTERVAL"
                      + value = "1m"
                    }
                  + env {
                      + name  = "RATE_LIMIT_REDIS_HOST"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "RATE_LIMIT_REDIS_PORT"
                      + value = (known after apply)
                    }
                  + env {
                      + name  = "RATE_LIMIT_TOKENS"
                      + value = "60"
                    }
                  + env {
                      + name  = "RATE_LIMIT_TYPE"
                      + value = "REDIS"
                    }
                  + env {
                      + name  = "TOKEN_KEY_MANAGER"
                      + value = "GOOGLE_CLOUD_KMS"
                    }
                  + env {
                      + name  = "TOKEN_SIGNING_KEY"
                      + value = (known after apply)
                    }

                  + ports {
                      + container_port = (known after apply)
                      + name           = (known after apply)
                      + protocol       = (known after apply)
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1"
                          + "memory" = "512Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = (known after apply)
          + percent         = (known after apply)
          + revision_name   = (known after apply)
        }
    }

  # module.en.google_cloud_run_service_iam_member.adminapi-public will be created
  + resource "google_cloud_run_service_iam_member" "adminapi-public" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = "allUsers"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
      + service  = "adminapi"
    }

  # module.en.google_cloud_run_service_iam_member.apiserver-public will be created
  + resource "google_cloud_run_service_iam_member" "apiserver-public" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = "allUsers"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
      + service  = "apiserver"
    }

  # module.en.google_cloud_run_service_iam_member.cleanup-invoker will be created
  + resource "google_cloud_run_service_iam_member" "cleanup-invoker" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = (known after apply)
      + project  = (known after apply)
      + role     = "roles/run.invoker"
      + service  = "cleanup"
    }

  # module.en.google_cloud_run_service_iam_member.e2e-runner-invoker will be created
  + resource "google_cloud_run_service_iam_member" "e2e-runner-invoker" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = (known after apply)
      + project  = (known after apply)
      + role     = "roles/run.invoker"
      + service  = "e2e-runner"
    }

  # module.en.google_cloud_run_service_iam_member.server-public will be created
  + resource "google_cloud_run_service_iam_member" "server-public" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = "allUsers"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
      + service  = "server"
    }

  # module.en.google_cloud_scheduler_job.cleanup-worker will be created
  + resource "google_cloud_scheduler_job" "cleanup-worker" {
      + attempt_deadline = "600s"
      + id               = (known after apply)
      + name             = "cleanup-worker"
      + project          = (known after apply)
      + region           = "us-central1"
      + schedule         = "0 * * * *"
      + time_zone        = "America/Los_Angeles"

      + http_target {
          + http_method = "GET"
          + uri         = (known after apply)

          + oidc_token {
              + audience              = (known after apply)
              + service_account_email = (known after apply)
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 1
        }
    }

  # module.en.google_cloud_scheduler_job.e2e-default-workflow will be created
  + resource "google_cloud_scheduler_job" "e2e-default-workflow" {
      + attempt_deadline = "600s"
      + id               = (known after apply)
      + name             = "e2e-default-workflow"
      + project          = (known after apply)
      + region           = "us-central1"
      + schedule         = "*/10 * * * *"
      + time_zone        = "America/Los_Angeles"

      + http_target {
          + http_method = "GET"
          + uri         = (known after apply)

          + oidc_token {
              + audience              = (known after apply)
              + service_account_email = (known after apply)
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 1
        }
    }

  # module.en.google_cloud_scheduler_job.e2e-revise-workflow will be created
  + resource "google_cloud_scheduler_job" "e2e-revise-workflow" {
      + attempt_deadline = "600s"
      + id               = (known after apply)
      + name             = "e2e-revise-workflow"
      + project          = (known after apply)
      + region           = "us-central1"
      + schedule         = "*/10 * * * *"
      + time_zone        = "America/Los_Angeles"

      + http_target {
          + http_method = "GET"
          + uri         = (known after apply)

          + oidc_token {
              + audience              = (known after apply)
              + service_account_email = (known after apply)
            }
        }

      + retry_config {
          + max_backoff_duration = (known after apply)
          + max_doublings        = (known after apply)
          + max_retry_duration   = (known after apply)
          + min_backoff_duration = (known after apply)
          + retry_count          = 1
        }
    }

  # module.en.google_compute_global_address.private_ip_address will be created
  + resource "google_compute_global_address" "private_ip_address" {
      + address            = (known after apply)
      + address_type       = "INTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "private-ip-address"
      + network            = "projects/cw-en-verification-9/global/networks/default"
      + prefix_length      = 16
      + project            = (known after apply)
      + purpose            = "VPC_PEERING"
      + self_link          = (known after apply)
    }

  # module.en.google_compute_region_network_endpoint_group.adminapi will be created
  + resource "google_compute_region_network_endpoint_group" "adminapi" {
      + id                    = (known after apply)
      + name                  = "adminapi"
      + network_endpoint_type = "SERVERLESS"
      + project               = "cw-en-verification-9"
      + region                = "us-central1"
      + self_link             = (known after apply)

      + cloud_run {
          + service = "adminapi"
        }
    }

  # module.en.google_compute_region_network_endpoint_group.apiserver will be created
  + resource "google_compute_region_network_endpoint_group" "apiserver" {
      + id                    = (known after apply)
      + name                  = "apiserver"
      + network_endpoint_type = "SERVERLESS"
      + project               = "cw-en-verification-9"
      + region                = "us-central1"
      + self_link             = (known after apply)

      + cloud_run {
          + service = "apiserver"
        }
    }

  # module.en.google_compute_region_network_endpoint_group.server will be created
  + resource "google_compute_region_network_endpoint_group" "server" {
      + id                    = (known after apply)
      + name                  = "server"
      + network_endpoint_type = "SERVERLESS"
      + project               = "cw-en-verification-9"
      + region                = "us-central1"
      + self_link             = (known after apply)

      + cloud_run {
          + service = "server"
        }
    }

  # module.en.google_compute_url_map.urlmap-http will be created
  + resource "google_compute_url_map" "urlmap-http" {
      + creation_timestamp = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "https-redirect"
      + project            = "cw-en-verification-9"
      + self_link          = (known after apply)

      + default_url_redirect {
          + https_redirect = true
          + strip_query    = false
        }
    }

  # module.en.google_firebase_project.default will be created
  + resource "google_firebase_project" "default" {
      + display_name   = (known after apply)
      + id             = (known after apply)
      + project        = "cw-en-verification-9"
      + project_number = (known after apply)
    }

  # module.en.google_firebase_web_app.default will be created
  + resource "google_firebase_web_app" "default" {
      + app_id       = (known after apply)
      + display_name = "Exposure Verifications"
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "cw-en-verification-9"
    }

  # module.en.google_kms_crypto_key.certificate-signer will be created
  + resource "google_kms_crypto_key" "certificate-signer" {
      + id        = (known after apply)
      + key_ring  = (known after apply)
      + name      = "certificate-signer"
      + purpose   = "ASYMMETRIC_SIGN"
      + self_link = (known after apply)

      + version_template {
          + algorithm        = "EC_SIGN_P256_SHA256"
          + protection_level = "HSM"
        }
    }

  # module.en.google_kms_crypto_key.database-encrypter will be created
  + resource "google_kms_crypto_key" "database-encrypter" {
      + id              = (known after apply)
      + key_ring        = (known after apply)
      + name            = "database-encrypter"
      + purpose         = "ENCRYPT_DECRYPT"
      + rotation_period = "2592000s"
      + self_link       = (known after apply)

      + version_template {
          + algorithm        = "GOOGLE_SYMMETRIC_ENCRYPTION"
          + protection_level = "HSM"
        }
    }

  # module.en.google_kms_crypto_key.token-signer will be created
  + resource "google_kms_crypto_key" "token-signer" {
      + id        = (known after apply)
      + key_ring  = (known after apply)
      + name      = "token-signer"
      + purpose   = "ASYMMETRIC_SIGN"
      + self_link = (known after apply)

      + version_template {
          + algorithm        = "EC_SIGN_P256_SHA256"
          + protection_level = "HSM"
        }
    }

  # module.en.google_kms_crypto_key_iam_member.adminapi-database-encrypter will be created
  + resource "google_kms_crypto_key_iam_member" "adminapi-database-encrypter" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + member        = (known after apply)
      + role          = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.en.google_kms_crypto_key_iam_member.apiserver-database-encrypter will be created
  + resource "google_kms_crypto_key_iam_member" "apiserver-database-encrypter" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + member        = (known after apply)
      + role          = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.en.google_kms_crypto_key_iam_member.cleanup-database-encrypter will be created
  + resource "google_kms_crypto_key_iam_member" "cleanup-database-encrypter" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + member        = (known after apply)
      + role          = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.en.google_kms_crypto_key_iam_member.database-database-encrypter will be created
  + resource "google_kms_crypto_key_iam_member" "database-database-encrypter" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + member        = "serviceAccount:295454028483@cloudbuild.gserviceaccount.com"
      + role          = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.en.google_kms_crypto_key_iam_member.e2e-runner-database-encrypter will be created
  + resource "google_kms_crypto_key_iam_member" "e2e-runner-database-encrypter" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + member        = (known after apply)
      + role          = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.en.google_kms_crypto_key_iam_member.server-database-encrypter will be created
  + resource "google_kms_crypto_key_iam_member" "server-database-encrypter" {
      + crypto_key_id = (known after apply)
      + etag          = (known after apply)
      + id            = (known after apply)
      + member        = (known after apply)
      + role          = "roles/cloudkms.cryptoKeyEncrypterDecrypter"
    }

  # module.en.google_kms_key_ring.verification will be created
  + resource "google_kms_key_ring" "verification" {
      + id        = (known after apply)
      + location  = "us-central1"
      + name      = "verification"
      + project   = "cw-en-verification-9"
      + self_link = (known after apply)
    }

  # module.en.google_kms_key_ring_iam_member.kms-signerverifier will be created
  + resource "google_kms_key_ring_iam_member" "kms-signerverifier" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + key_ring_id = (known after apply)
      + member      = (known after apply)
      + role        = "roles/cloudkms.signerVerifier"
    }

  # module.en.google_kms_key_ring_iam_member.server-verification-key-admin will be created
  + resource "google_kms_key_ring_iam_member" "server-verification-key-admin" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + key_ring_id = (known after apply)
      + member      = (known after apply)
      + role        = "roles/cloudkms.admin"
    }

  # module.en.google_kms_key_ring_iam_member.server-verification-key-signer-verifier will be created
  + resource "google_kms_key_ring_iam_member" "server-verification-key-signer-verifier" {
      + etag        = (known after apply)
      + id          = (known after apply)
      + key_ring_id = (known after apply)
      + member      = (known after apply)
      + role        = "roles/cloudkms.signerVerifier"
    }

  # module.en.google_project_iam_member.adminapi-observability["roles/cloudtrace.agent"] will be created
  + resource "google_project_iam_member" "adminapi-observability" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cw-en-verification-9"
      + role    = "roles/cloudtrace.agent"
    }

  # module.en.google_project_iam_member.adminapi-observability["roles/logging.logWriter"] will be created
  + resource "google_project_iam_member" "adminapi-observability" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cw-en-verification-9"
      + role    = "roles/logging.logWriter"
    }

  # module.en.google_project_iam_member.adminapi-observability["roles/monitoring.metricWriter"] will be created
  + resource "google_project_iam_member" "adminapi-observability" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cw-en-verification-9"
      + role    = "roles/monitoring.metricWriter"
    }

  # module.en.google_project_iam_member.adminapi-observability["roles/stackdriver.resourceMetadata.writer"] will be created
  + resource "google_project_iam_member" "adminapi-observability" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cw-en-verification-9"
      + role    = "roles/stackdriver.resourceMetadata.writer"
    }

  # module.en.google_project_iam_member.apiserver-observability["roles/cloudtrace.agent"] will be created
  + resource "google_project_iam_member" "apiserver-observability" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cw-en-verification-9"
      + role    = "roles/cloudtrace.agent"
    }

  # module.en.google_project_iam_member.apiserver-observability["roles/logging.logWriter"] will be created
  + resource "google_project_iam_member" "apiserver-observability" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cw-en-verification-9"
      + role    = "roles/logging.logWriter"
    }

  # module.en.google_project_iam_member.apiserver-observability["roles/monitoring.metricWriter"] will be created
  + resource "google_project_iam_member" "apiserver-observability" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cw-en-verification-9"
      + role    = "roles/monitoring.metricWriter"
    }

  # module.en.google_project_iam_member.apiserver-observability["roles/stackdriver.resourceMetadata.writer"] will be created
  + resource "google_project_iam_member" "apiserver-observability" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cw-en-verification-9"
      + role    = "roles/stackdriver.resourceMetadata.writer"
    }

  # module.en.google_project_iam_member.cleanup-observability["roles/cloudtrace.agent"] will be created
  + resource "google_project_iam_member" "cleanup-observability" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cw-en-verification-9"
      + role    = "roles/cloudtrace.agent"
    }

  # module.en.google_project_iam_member.cleanup-observability["roles/logging.logWriter"] will be created
  + resource "google_project_iam_member" "cleanup-observability" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cw-en-verification-9"
      + role    = "roles/logging.logWriter"
    }

  # module.en.google_project_iam_member.cleanup-observability["roles/monitoring.metricWriter"] will be created
  + resource "google_project_iam_member" "cleanup-observability" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cw-en-verification-9"
      + role    = "roles/monitoring.metricWriter"
    }

  # module.en.google_project_iam_member.cleanup-observability["roles/stackdriver.resourceMetadata.writer"] will be created
  + resource "google_project_iam_member" "cleanup-observability" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cw-en-verification-9"
      + role    = "roles/stackdriver.resourceMetadata.writer"
    }

  # module.en.google_project_iam_member.cloudbuild-deploy will be created
  + resource "google_project_iam_member" "cloudbuild-deploy" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:295454028483@cloudbuild.gserviceaccount.com"
      + project = "cw-en-verification-9"
      + role    = "roles/run.admin"
    }

  # module.en.google_project_iam_member.cloudbuild-sql will be created
  + resource "google_project_iam_member" "cloudbuild-sql" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:295454028483@cloudbuild.gserviceaccount.com"
      + project = "cw-en-verification-9"
      + role    = "roles/cloudsql.client"
    }

  # module.en.google_project_iam_member.e2e-runner-observability["roles/cloudtrace.agent"] will be created
  + resource "google_project_iam_member" "e2e-runner-observability" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cw-en-verification-9"
      + role    = "roles/cloudtrace.agent"
    }

  # module.en.google_project_iam_member.e2e-runner-observability["roles/logging.logWriter"] will be created
  + resource "google_project_iam_member" "e2e-runner-observability" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cw-en-verification-9"
      + role    = "roles/logging.logWriter"
    }

  # module.en.google_project_iam_member.e2e-runner-observability["roles/monitoring.metricWriter"] will be created
  + resource "google_project_iam_member" "e2e-runner-observability" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cw-en-verification-9"
      + role    = "roles/monitoring.metricWriter"
    }

  # module.en.google_project_iam_member.e2e-runner-observability["roles/stackdriver.resourceMetadata.writer"] will be created
  + resource "google_project_iam_member" "e2e-runner-observability" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cw-en-verification-9"
      + role    = "roles/stackdriver.resourceMetadata.writer"
    }

  # module.en.google_project_iam_member.firebase-admin will be created
  + resource "google_project_iam_member" "firebase-admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cw-en-verification-9"
      + role    = "roles/firebaseauth.admin"
    }

  # module.en.google_project_iam_member.server-observability["roles/cloudtrace.agent"] will be created
  + resource "google_project_iam_member" "server-observability" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cw-en-verification-9"
      + role    = "roles/cloudtrace.agent"
    }

  # module.en.google_project_iam_member.server-observability["roles/logging.logWriter"] will be created
  + resource "google_project_iam_member" "server-observability" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cw-en-verification-9"
      + role    = "roles/logging.logWriter"
    }

  # module.en.google_project_iam_member.server-observability["roles/monitoring.metricWriter"] will be created
  + resource "google_project_iam_member" "server-observability" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cw-en-verification-9"
      + role    = "roles/monitoring.metricWriter"
    }

  # module.en.google_project_iam_member.server-observability["roles/stackdriver.resourceMetadata.writer"] will be created
  + resource "google_project_iam_member" "server-observability" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "cw-en-verification-9"
      + role    = "roles/stackdriver.resourceMetadata.writer"
    }

  # module.en.google_project_service.services["cloudbuild.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "cw-en-verification-9"
      + service            = "cloudbuild.googleapis.com"
    }

  # module.en.google_project_service.services["cloudidentity.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "cw-en-verification-9"
      + service            = "cloudidentity.googleapis.com"
    }

  # module.en.google_project_service.services["cloudkms.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "cw-en-verification-9"
      + service            = "cloudkms.googleapis.com"
    }

  # module.en.google_project_service.services["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "cw-en-verification-9"
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # module.en.google_project_service.services["cloudscheduler.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "cw-en-verification-9"
      + service            = "cloudscheduler.googleapis.com"
    }

  # module.en.google_project_service.services["compute.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "cw-en-verification-9"
      + service            = "compute.googleapis.com"
    }

  # module.en.google_project_service.services["containerregistry.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "cw-en-verification-9"
      + service            = "containerregistry.googleapis.com"
    }

  # module.en.google_project_service.services["firebase.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "cw-en-verification-9"
      + service            = "firebase.googleapis.com"
    }

  # module.en.google_project_service.services["iam.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "cw-en-verification-9"
      + service            = "iam.googleapis.com"
    }

  # module.en.google_project_service.services["identitytoolkit.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "cw-en-verification-9"
      + service            = "identitytoolkit.googleapis.com"
    }

  # module.en.google_project_service.services["redis.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "cw-en-verification-9"
      + service            = "redis.googleapis.com"
    }

  # module.en.google_project_service.services["run.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "cw-en-verification-9"
      + service            = "run.googleapis.com"
    }

  # module.en.google_project_service.services["secretmanager.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "cw-en-verification-9"
      + service            = "secretmanager.googleapis.com"
    }

  # module.en.google_project_service.services["servicenetworking.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "cw-en-verification-9"
      + service            = "servicenetworking.googleapis.com"
    }

  # module.en.google_project_service.services["sql-component.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "cw-en-verification-9"
      + service            = "sql-component.googleapis.com"
    }

  # module.en.google_project_service.services["sqladmin.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "cw-en-verification-9"
      + service            = "sqladmin.googleapis.com"
    }

  # module.en.google_project_service.services["storage.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "cw-en-verification-9"
      + service            = "storage.googleapis.com"
    }

  # module.en.google_project_service.services["vpcaccess.googleapis.com"] will be created
  + resource "google_project_service" "services" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "cw-en-verification-9"
      + service            = "vpcaccess.googleapis.com"
    }

  # module.en.google_redis_instance.cache will be created
  + resource "google_redis_instance" "cache" {
      + alternative_location_id  = "us-central1-c"
      + authorized_network       = "projects/cw-en-verification-9/global/networks/default"
      + connect_mode             = "PRIVATE_SERVICE_ACCESS"
      + create_time              = (known after apply)
      + current_location_id      = (known after apply)
      + host                     = (known after apply)
      + id                       = (known after apply)
      + location_id              = "us-central1-a"
      + memory_size_gb           = 8
      + name                     = "verification-cache"
      + persistence_iam_identity = (known after apply)
      + port                     = (known after apply)
      + project                  = (known after apply)
      + redis_version            = "REDIS_5_0"
      + region                   = (known after apply)
      + reserved_ip_range        = (known after apply)
      + tier                     = "STANDARD_HA"
    }

  # module.en.google_secret_manager_secret.cache-hmac-key will be created
  + resource "google_secret_manager_secret" "cache-hmac-key" {
      + create_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "cache-hmac-key"

      + replication {
          + automatic = true
        }
    }

  # module.en.google_secret_manager_secret.cookie-encryption-key will be created
  + resource "google_secret_manager_secret" "cookie-encryption-key" {
      + create_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "cookie-encryption-key"

      + replication {
          + automatic = true
        }
    }

  # module.en.google_secret_manager_secret.cookie-hmac-key will be created
  + resource "google_secret_manager_secret" "cookie-hmac-key" {
      + create_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "cookie-hmac-key"

      + replication {
          + automatic = true
        }
    }

  # module.en.google_secret_manager_secret.csrf-token will be created
  + resource "google_secret_manager_secret" "csrf-token" {
      + create_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "csrf-token"

      + replication {
          + automatic = true
        }
    }

  # module.en.google_secret_manager_secret.db-apikey-db-hmac will be created
  + resource "google_secret_manager_secret" "db-apikey-db-hmac" {
      + create_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "db-apikey-db-hmac"

      + replication {
          + automatic = true
        }
    }

  # module.en.google_secret_manager_secret.db-apikey-sig-hmac will be created
  + resource "google_secret_manager_secret" "db-apikey-sig-hmac" {
      + create_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "db-apikey-sig-hmac"

      + replication {
          + automatic = true
        }
    }

  # module.en.google_secret_manager_secret.db-secret["password"] will be created
  + resource "google_secret_manager_secret" "db-secret" {
      + create_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "db-password"

      + replication {
          + automatic = true
        }
    }

  # module.en.google_secret_manager_secret.db-secret["sslcert"] will be created
  + resource "google_secret_manager_secret" "db-secret" {
      + create_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "db-sslcert"

      + replication {
          + automatic = true
        }
    }

  # module.en.google_secret_manager_secret.db-secret["sslkey"] will be created
  + resource "google_secret_manager_secret" "db-secret" {
      + create_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "db-sslkey"

      + replication {
          + automatic = true
        }
    }

  # module.en.google_secret_manager_secret.db-secret["sslrootcert"] will be created
  + resource "google_secret_manager_secret" "db-secret" {
      + create_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "db-sslrootcert"

      + replication {
          + automatic = true
        }
    }

  # module.en.google_secret_manager_secret.db-verification-code-hmac will be created
  + resource "google_secret_manager_secret" "db-verification-code-hmac" {
      + create_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "db-verification-code-hmac"

      + replication {
          + automatic = true
        }
    }

  # module.en.google_secret_manager_secret_iam_member.adminapi-db["password"] will be created
  + resource "google_secret_manager_secret_iam_member" "adminapi-db" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.adminapi-db["sslcert"] will be created
  + resource "google_secret_manager_secret_iam_member" "adminapi-db" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.adminapi-db["sslkey"] will be created
  + resource "google_secret_manager_secret_iam_member" "adminapi-db" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.adminapi-db["sslrootcert"] will be created
  + resource "google_secret_manager_secret_iam_member" "adminapi-db" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.adminapi-db-apikey-db-hmac will be created
  + resource "google_secret_manager_secret_iam_member" "adminapi-db-apikey-db-hmac" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.adminapi-db-apikey-sig-hmac will be created
  + resource "google_secret_manager_secret_iam_member" "adminapi-db-apikey-sig-hmac" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.adminapi-db-verification-code-hmac will be created
  + resource "google_secret_manager_secret_iam_member" "adminapi-db-verification-code-hmac" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.apiserver-db["password"] will be created
  + resource "google_secret_manager_secret_iam_member" "apiserver-db" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.apiserver-db["sslcert"] will be created
  + resource "google_secret_manager_secret_iam_member" "apiserver-db" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.apiserver-db["sslkey"] will be created
  + resource "google_secret_manager_secret_iam_member" "apiserver-db" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.apiserver-db["sslrootcert"] will be created
  + resource "google_secret_manager_secret_iam_member" "apiserver-db" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.apiserver-db-apikey-db-hmac will be created
  + resource "google_secret_manager_secret_iam_member" "apiserver-db-apikey-db-hmac" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.apiserver-db-apikey-sig-hmac will be created
  + resource "google_secret_manager_secret_iam_member" "apiserver-db-apikey-sig-hmac" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.apiserver-db-verification-code-hmac will be created
  + resource "google_secret_manager_secret_iam_member" "apiserver-db-verification-code-hmac" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.cleanup-db["password"] will be created
  + resource "google_secret_manager_secret_iam_member" "cleanup-db" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.cleanup-db["sslcert"] will be created
  + resource "google_secret_manager_secret_iam_member" "cleanup-db" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.cleanup-db["sslkey"] will be created
  + resource "google_secret_manager_secret_iam_member" "cleanup-db" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.cleanup-db["sslrootcert"] will be created
  + resource "google_secret_manager_secret_iam_member" "cleanup-db" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.cleanup-db-apikey-db-hmac will be created
  + resource "google_secret_manager_secret_iam_member" "cleanup-db-apikey-db-hmac" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.cleanup-db-apikey-sig-hmac will be created
  + resource "google_secret_manager_secret_iam_member" "cleanup-db-apikey-sig-hmac" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.cleanup-db-verification-code-hmac will be created
  + resource "google_secret_manager_secret_iam_member" "cleanup-db-verification-code-hmac" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.cloudbuild-db-apikey-db-hmac will be created
  + resource "google_secret_manager_secret_iam_member" "cloudbuild-db-apikey-db-hmac" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:295454028483@cloudbuild.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.cloudbuild-db-apikey-sig-hmac will be created
  + resource "google_secret_manager_secret_iam_member" "cloudbuild-db-apikey-sig-hmac" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:295454028483@cloudbuild.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.cloudbuild-db-pwd will be created
  + resource "google_secret_manager_secret_iam_member" "cloudbuild-db-pwd" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:295454028483@cloudbuild.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.cloudbuild-db-verification-code-hmac will be created
  + resource "google_secret_manager_secret_iam_member" "cloudbuild-db-verification-code-hmac" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:295454028483@cloudbuild.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.e2e-runner-db["password"] will be created
  + resource "google_secret_manager_secret_iam_member" "e2e-runner-db" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.e2e-runner-db["sslcert"] will be created
  + resource "google_secret_manager_secret_iam_member" "e2e-runner-db" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.e2e-runner-db["sslkey"] will be created
  + resource "google_secret_manager_secret_iam_member" "e2e-runner-db" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.e2e-runner-db["sslrootcert"] will be created
  + resource "google_secret_manager_secret_iam_member" "e2e-runner-db" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.e2e-runner-db-apikey-db-hmac will be created
  + resource "google_secret_manager_secret_iam_member" "e2e-runner-db-apikey-db-hmac" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.e2e-runner-db-apikey-sig-hmac will be created
  + resource "google_secret_manager_secret_iam_member" "e2e-runner-db-apikey-sig-hmac" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.e2e-runner-db-verification-code-hmac will be created
  + resource "google_secret_manager_secret_iam_member" "e2e-runner-db-verification-code-hmac" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.server-cookie-encryption-key will be created
  + resource "google_secret_manager_secret_iam_member" "server-cookie-encryption-key" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.server-cookie-hmac-key will be created
  + resource "google_secret_manager_secret_iam_member" "server-cookie-hmac-key" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.server-csrf will be created
  + resource "google_secret_manager_secret_iam_member" "server-csrf" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.server-db["password"] will be created
  + resource "google_secret_manager_secret_iam_member" "server-db" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.server-db["sslcert"] will be created
  + resource "google_secret_manager_secret_iam_member" "server-db" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.server-db["sslkey"] will be created
  + resource "google_secret_manager_secret_iam_member" "server-db" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.server-db["sslrootcert"] will be created
  + resource "google_secret_manager_secret_iam_member" "server-db" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.server-db-apikey-db-hmac will be created
  + resource "google_secret_manager_secret_iam_member" "server-db-apikey-db-hmac" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.server-db-apikey-sig-hmac will be created
  + resource "google_secret_manager_secret_iam_member" "server-db-apikey-sig-hmac" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_iam_member.server-db-verification-code-hmac will be created
  + resource "google_secret_manager_secret_iam_member" "server-db-verification-code-hmac" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = (known after apply)
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # module.en.google_secret_manager_secret_version.cache-hmac-key will be created
  + resource "google_secret_manager_secret_version" "cache-hmac-key" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

  # module.en.google_secret_manager_secret_version.cookie-encryption-key-version will be created
  + resource "google_secret_manager_secret_version" "cookie-encryption-key-version" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

  # module.en.google_secret_manager_secret_version.cookie-hmac-key-version will be created
  + resource "google_secret_manager_secret_version" "cookie-hmac-key-version" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

  # module.en.google_secret_manager_secret_version.csrf-token-version will be created
  + resource "google_secret_manager_secret_version" "csrf-token-version" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

  # module.en.google_secret_manager_secret_version.db-apikey-db-hmac will be created
  + resource "google_secret_manager_secret_version" "db-apikey-db-hmac" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

  # module.en.google_secret_manager_secret_version.db-apikey-sig-hmac will be created
  + resource "google_secret_manager_secret_version" "db-apikey-sig-hmac" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

  # module.en.google_secret_manager_secret_version.db-secret-version["password"] will be created
  + resource "google_secret_manager_secret_version" "db-secret-version" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

  # module.en.google_secret_manager_secret_version.db-secret-version["sslcert"] will be created
  + resource "google_secret_manager_secret_version" "db-secret-version" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

  # module.en.google_secret_manager_secret_version.db-secret-version["sslkey"] will be created
  + resource "google_secret_manager_secret_version" "db-secret-version" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

  # module.en.google_secret_manager_secret_version.db-secret-version["sslrootcert"] will be created
  + resource "google_secret_manager_secret_version" "db-secret-version" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

  # module.en.google_secret_manager_secret_version.db-verification-code-hmac will be created
  + resource "google_secret_manager_secret_version" "db-verification-code-hmac" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
    }

  # module.en.google_service_account.adminapi will be created
  + resource "google_service_account" "adminapi" {
      + account_id   = "en-verification-adminapi-sa"
      + display_name = "Verification Admin apiserver"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "cw-en-verification-9"
      + unique_id    = (known after apply)
    }

  # module.en.google_service_account.apiserver will be created
  + resource "google_service_account" "apiserver" {
      + account_id   = "en-verification-apiserver-sa"
      + display_name = "Verification apiserver"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "cw-en-verification-9"
      + unique_id    = (known after apply)
    }

  # module.en.google_service_account.cleanup will be created
  + resource "google_service_account" "cleanup" {
      + account_id   = "en-verification-cleanup-sa"
      + display_name = "Verification cleanup"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "cw-en-verification-9"
      + unique_id    = (known after apply)
    }

  # module.en.google_service_account.cleanup-invoker will be created
  + resource "google_service_account" "cleanup-invoker" {
      + account_id   = "en-cleanup-invoker-sa"
      + display_name = "Verification cleanup invoker"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "cw-en-verification-9"
      + unique_id    = (known after apply)
    }

  # module.en.google_service_account.e2e-runner will be created
  + resource "google_service_account" "e2e-runner" {
      + account_id   = "en-verification-e2e-runner-sa"
      + display_name = "Verification e2e-runner"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "cw-en-verification-9"
      + unique_id    = (known after apply)
    }

  # module.en.google_service_account.e2e-runner-invoker will be created
  + resource "google_service_account" "e2e-runner-invoker" {
      + account_id   = "en-e2e-runner-invoker-sa"
      + display_name = "Verification e2e-runner invoker"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "cw-en-verification-9"
      + unique_id    = (known after apply)
    }

  # module.en.google_service_account.server will be created
  + resource "google_service_account" "server" {
      + account_id   = "en-verification-server-sa"
      + display_name = "Verification server"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "cw-en-verification-9"
      + unique_id    = (known after apply)
    }

  # module.en.google_service_account_iam_member.cloudbuild-deploy-adminapi will be created
  + resource "google_service_account_iam_member" "cloudbuild-deploy-adminapi" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:295454028483@cloudbuild.gserviceaccount.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # module.en.google_service_account_iam_member.cloudbuild-deploy-apiserver will be created
  + resource "google_service_account_iam_member" "cloudbuild-deploy-apiserver" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:295454028483@cloudbuild.gserviceaccount.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # module.en.google_service_account_iam_member.cloudbuild-deploy-cleanup will be created
  + resource "google_service_account_iam_member" "cloudbuild-deploy-cleanup" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:295454028483@cloudbuild.gserviceaccount.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # module.en.google_service_account_iam_member.cloudbuild-deploy-e2e-runner will be created
  + resource "google_service_account_iam_member" "cloudbuild-deploy-e2e-runner" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:295454028483@cloudbuild.gserviceaccount.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # module.en.google_service_account_iam_member.cloudbuild-deploy-server will be created
  + resource "google_service_account_iam_member" "cloudbuild-deploy-server" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:295454028483@cloudbuild.gserviceaccount.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # module.en.google_service_networking_connection.private_vpc_connection will be created
  + resource "google_service_networking_connection" "private_vpc_connection" {
      + id                      = (known after apply)
      + network                 = "projects/cw-en-verification-9/global/networks/default"
      + peering                 = (known after apply)
      + reserved_peering_ranges = [
          + "private-ip-address",
        ]
      + service                 = "servicenetworking.googleapis.com"
    }

  # module.en.google_sql_database.db will be created
  + resource "google_sql_database" "db" {
      + charset   = (known after apply)
      + collation = (known after apply)
      + id        = (known after apply)
      + instance  = "en-verification"
      + name      = "verification"
      + project   = "cw-en-verification-9"
      + self_link = (known after apply)
    }

  # module.en.google_sql_database_instance.db-inst will be created
  + resource "google_sql_database_instance" "db-inst" {
      + connection_name               = (known after apply)
      + database_version              = "POSTGRES_12"
      + first_ip_address              = (known after apply)
      + id                            = (known after apply)
      + ip_address                    = (known after apply)
      + master_instance_name          = (known after apply)
      + name                          = "en-verification"
      + private_ip_address            = (known after apply)
      + project                       = "cw-en-verification-9"
      + public_ip_address             = (known after apply)
      + region                        = "us-central1"
      + self_link                     = (known after apply)
      + server_ca_cert                = (known after apply)
      + service_account_email_address = (known after apply)

      + replica_configuration {
          + ca_certificate            = (known after apply)
          + client_certificate        = (known after apply)
          + client_key                = (known after apply)
          + connect_retry_interval    = (known after apply)
          + dump_file_path            = (known after apply)
          + failover_target           = (known after apply)
          + master_heartbeat_period   = (known after apply)
          + password                  = (sensitive value)
          + ssl_cipher                = (known after apply)
          + username                  = (known after apply)
          + verify_server_certificate = (known after apply)
        }

      + settings {
          + activation_policy      = (known after apply)
          + availability_type      = "REGIONAL"
          + crash_safe_replication = (known after apply)
          + disk_autoresize        = true
          + disk_size              = 16
          + disk_type              = (known after apply)
          + pricing_plan           = "PER_USE"
          + replication_type       = "SYNCHRONOUS"
          + tier                   = "db-custom-1-3840"
          + version                = (known after apply)

          + backup_configuration {
              + enabled    = true
              + location   = "us"
              + start_time = "02:00"
            }

          + database_flags {
              + name  = "autovacuum"
              + value = "on"
            }
          + database_flags {
              + name  = "max_connections"
              + value = "256"
            }

          + ip_configuration {
              + ipv4_enabled    = true
              + private_network = "projects/cw-en-verification-9/global/networks/default"
              + require_ssl     = true
            }

          + location_preference {
              + follow_gae_application = (known after apply)
              + zone                   = (known after apply)
            }

          + maintenance_window {
              + day          = 7
              + hour         = 2
              + update_track = "stable"
            }
        }
    }

  # module.en.google_sql_ssl_cert.db-cert will be created
  + resource "google_sql_ssl_cert" "db-cert" {
      + cert               = (known after apply)
      + cert_serial_number = (known after apply)
      + common_name        = "verification"
      + create_time        = (known after apply)
      + expiration_time    = (known after apply)
      + id                 = (known after apply)
      + instance           = "en-verification"
      + private_key        = (sensitive value)
      + project            = "cw-en-verification-9"
      + server_ca_cert     = (known after apply)
      + sha1_fingerprint   = (known after apply)
    }

  # module.en.google_sql_user.user will be created
  + resource "google_sql_user" "user" {
      + id       = (known after apply)
      + instance = "en-verification"
      + name     = "verification"
      + password = (sensitive value)
      + project  = (known after apply)
    }

  # module.en.google_storage_bucket.cloudbuild-cache will be created
  + resource "google_storage_bucket" "cloudbuild-cache" {
      + bucket_policy_only          = true
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "US"
      + name                        = "cw-en-verification-9-cloudbuild-cache"
      + project                     = "cw-en-verification-9"
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type = "Delete"
            }

          + condition {
              + age                   = 14
              + is_live               = (known after apply)
              + matches_storage_class = []
              + with_state            = (known after apply)
            }
        }
    }

  # module.en.google_storage_bucket_iam_member.cloudbuild-cache will be created
  + resource "google_storage_bucket_iam_member" "cloudbuild-cache" {
      + bucket = "cw-en-verification-9-cloudbuild-cache"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:295454028483@cloudbuild.gserviceaccount.com"
      + role   = "roles/storage.objectAdmin"
    }

  # module.en.google_vpc_access_connector.connector will be created
  + resource "google_vpc_access_connector" "connector" {
      + id             = (known after apply)
      + ip_cidr_range  = "10.8.0.0/28"
      + max_throughput = 300
      + min_throughput = 200
      + name           = "serverless-vpc-connector"
      + network        = "default"
      + project        = "cw-en-verification-9"
      + region         = "us-central1"
      + self_link      = (known after apply)
      + state          = (known after apply)
    }

  # module.en.local_file.env[0] will be created
  + resource "local_file" "env" {
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "./.env"
      + id                   = (known after apply)
      + sensitive_content    = (sensitive value)
    }

  # module.en.null_resource.build will be created
  + resource "null_resource" "build" {
      + id = (known after apply)
    }

  # module.en.null_resource.migrate will be created
  + resource "null_resource" "migrate" {
      + id = (known after apply)
    }

  # module.en.random_id.cache-hmac-key will be created
  + resource "random_id" "cache-hmac-key" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 128
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.en.random_id.cookie-encryption-key will be created
  + resource "random_id" "cookie-encryption-key" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 32
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.en.random_id.cookie-hmac-key will be created
  + resource "random_id" "cookie-hmac-key" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 32
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.en.random_id.csrf-token will be created
  + resource "random_id" "csrf-token" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 32
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.en.random_id.db-apikey-db-hmac will be created
  + resource "random_id" "db-apikey-db-hmac" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 128
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.en.random_id.db-apikey-sig-hmac will be created
  + resource "random_id" "db-apikey-sig-hmac" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 128
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.en.random_id.db-verification-code-hmac will be created
  + resource "random_id" "db-verification-code-hmac" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 128
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.en.random_password.db-password will be created
  + resource "random_password" "db-password" {
      + id          = (known after apply)
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.en.random_string.db-name will be created
  + resource "random_string" "db-name" {
      + id          = (known after apply)
      + length      = 5
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 172 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + en = {
      + adminapi_url                    = (known after apply)
      + apiserver_url                   = (known after apply)
      + cleanup_url                     = (known after apply)
      + cloudscheduler_location         = "us-central1"
      + cookie_keys                     = (known after apply)
      + db_apikey_database_key_secret   = (known after apply)
      + db_apikey_signature_key_secret  = (known after apply)
      + db_conn                         = (known after apply)
      + db_encryption_key_secret        = (known after apply)
      + db_host                         = (known after apply)
      + db_name                         = "verification"
      + db_password                     = (known after apply)
      + db_user                         = "verification"
      + db_verification_code_key_secret = (known after apply)
      + e2e_runner_url                  = (known after apply)
      + firebase_api_key                = (known after apply)
      + firebase_app_id                 = (known after apply)
      + firebase_auth_domain            = (known after apply)
      + firebase_database_url           = (known after apply)
      + firebase_measurement_id         = (known after apply)
      + firebase_messaging_sender_id    = (known after apply)
      + firebase_project_id             = "cw-en-verification-9"
      + firebase_storage_bucket         = (known after apply)
      + migrate_command                 = (known after apply)
      + next_steps                      = {
          + enable_authentication_providers = "https://console.firebase.google.com/project/cw-en-verification-9/authentication/providers"
        }
      + project_id                      = "cw-en-verification-9"
      + project_number                  = "295454028483"
      + proxy_command                   = (known after apply)
      + proxy_env                       = (known after apply)
      + psql_env                        = (known after apply)
      + redis_host                      = (known after apply)
      + redis_port                      = (known after apply)
      + region                          = "us-central1"
      + server_url                      = (known after apply)
    }


Warning: "bucket_policy_only": [DEPRECATED] Please use the uniform_bucket_level_access as this field has been renamed by Google.

  on .terraform/modules/en/terraform/build.tf line 15, in resource "google_storage_bucket" "cloudbuild-cache":
  15: resource "google_storage_bucket" "cloudbuild-cache" {


Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.en.random_id.csrf-token: Creating...
module.en.random_id.db-apikey-db-hmac: Creating...
module.en.random_id.cookie-encryption-key: Creating...
module.en.random_id.db-verification-code-hmac: Creating...
module.en.random_id.cookie-hmac-key: Creating...
module.en.random_string.db-name: Creating...
module.en.random_id.cache-hmac-key: Creating...
module.en.random_id.db-apikey-db-hmac: Creation complete after 0s [id=MBsXmkuyo6bBvvPAEM31Q2mlZ7nGYnoZc9ILzIgJc7ttSHMUinqdWBUNi8UI88jyuYwIWHU4W-LREOl3by2hvFDNKvWRc3xik8DaLIKjgMe5uk2vtJK9XEgGGqH3AGNfvwVp3rWXWYr1pRm7AMRqVYEtXvstClaY1rF6NL4_gQs]
module.en.random_password.db-password: Creating...
module.en.random_id.csrf-token: Creation complete after 0s [id=aIk1JTTOd71L1c70ssLJ61OeDvFKtg6j4E4NhaU6g5g]
module.en.random_id.cookie-encryption-key: Creation complete after 0s [id=ySSNgPwLOVnhGNvayeZqfgGfeEtpr4LB3qFu95kG3V4]
module.en.random_id.cookie-hmac-key: Creation complete after 0s [id=LI8i_AiwPtpty-KsB0sT6u7IWZpDsORp6vyCB3bqKKk]
module.en.random_id.db-verification-code-hmac: Creation complete after 0s [id=MZzFiKClWLcfeZS2nGdZLQTnvG4Mt4j72k3J7MHZUsKc5aJ2UUb-DPghYRcWjNNGy16fYK_JcH1ImpTIDJPat2_8cuI1f3P_x2hszLbH0Rsr-smojfJF3OZ6XfgI55I78EsXWxEdcFEMqGzVmbqqlAj32klOs8hh0BW_w8Tw41w]
module.en.random_string.db-name: Creation complete after 0s [id=prmvn]
module.en.random_id.cache-hmac-key: Creation complete after 0s [id=zXowsL5CuiBjanWRvX4_-5RHEJSu5VAwp6kJJ5TAsKqpnA25nDuIbgBU3o_iizA3FUzLXjmk0wPXlV-VK3cbq4AzKomOA1Q9McwKp8Tq6I05AybFoj2frisabak6FvlObb-r1Z3U8hgcB8pQV-nKEP4P3bmlOgO2zT8jtvVcvbw]
module.en.random_id.db-apikey-sig-hmac: Creating...
module.en.random_password.db-password: Creation complete after 0s [id=none]
module.en.random_id.db-apikey-sig-hmac: Creation complete after 0s [id=LCBNjbuR09FPXMMfQzGq9ki1uyXFn03YCjKiY0ELwPnKUqSZwOXW8pkpfu6g-pI5eSNTE1KJ2mqs90cj2JryHfGsXzcri_pmC9345gkNEiP4E5Nth3vtCIgInVLBTtZPqjkrBWRgE8w6ux4EASpwmp2TDL48BuaVsfbyGWJuo7Y]
module.en.google_service_account.adminapi: Creating...
module.en.google_service_account.e2e-runner: Creating...
module.en.google_project_service.services["containerregistry.googleapis.com"]: Creating...
module.en.google_project_service.services["sqladmin.googleapis.com"]: Creating...
module.en.google_project_service.services["iam.googleapis.com"]: Creating...
module.en.google_project_service.services["storage.googleapis.com"]: Creating...
module.en.google_project_service.services["servicenetworking.googleapis.com"]: Creating...
module.en.google_project_service.services["vpcaccess.googleapis.com"]: Creating...
module.en.google_service_account.cleanup-invoker: Creating...
module.en.google_project_service.services["cloudkms.googleapis.com"]: Creating...
module.en.google_service_account.cleanup-invoker: Creation complete after 1s [id=projects/cw-en-verification-9/serviceAccounts/en-cleanup-invoker-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_service_account.adminapi: Creation complete after 1s [id=projects/cw-en-verification-9/serviceAccounts/en-verification-adminapi-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_service.services["secretmanager.googleapis.com"]: Creating...
module.en.google_project_service.services["cloudidentity.googleapis.com"]: Creating...
module.en.google_service_account.e2e-runner: Creation complete after 2s [id=projects/cw-en-verification-9/serviceAccounts/en-verification-e2e-runner-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_service.services["identitytoolkit.googleapis.com"]: Creating...
module.en.google_project_service.services["storage.googleapis.com"]: Creation complete after 3s [id=cw-en-verification-9/storage.googleapis.com]
module.en.google_app_engine_application.app: Creating...
module.en.google_project_service.services["containerregistry.googleapis.com"]: Still creating... [10s elapsed]
module.en.google_project_service.services["sqladmin.googleapis.com"]: Still creating... [10s elapsed]
module.en.google_project_service.services["iam.googleapis.com"]: Still creating... [10s elapsed]
module.en.google_project_service.services["vpcaccess.googleapis.com"]: Still creating... [10s elapsed]
module.en.google_project_service.services["servicenetworking.googleapis.com"]: Still creating... [10s elapsed]
module.en.google_project_service.services["cloudkms.googleapis.com"]: Still creating... [10s elapsed]
module.en.google_project_service.services["secretmanager.googleapis.com"]: Still creating... [10s elapsed]
module.en.google_project_service.services["cloudidentity.googleapis.com"]: Still creating... [10s elapsed]
module.en.google_project_service.services["identitytoolkit.googleapis.com"]: Still creating... [10s elapsed]
module.en.google_app_engine_application.app: Still creating... [10s elapsed]
module.en.google_app_engine_application.app: Creation complete after 12s [id=cw-en-verification-9]
module.en.google_project_service.services["cloudresourcemanager.googleapis.com"]: Creating...
module.en.google_project_service.services["iam.googleapis.com"]: Still creating... [20s elapsed]
module.en.google_project_service.services["containerregistry.googleapis.com"]: Still creating... [20s elapsed]
module.en.google_project_service.services["sqladmin.googleapis.com"]: Still creating... [20s elapsed]
module.en.google_project_service.services["vpcaccess.googleapis.com"]: Still creating... [20s elapsed]
module.en.google_project_service.services["servicenetworking.googleapis.com"]: Still creating... [20s elapsed]
module.en.google_project_service.services["cloudkms.googleapis.com"]: Still creating... [20s elapsed]
module.en.google_project_service.services["secretmanager.googleapis.com"]: Still creating... [20s elapsed]
module.en.google_project_service.services["cloudidentity.googleapis.com"]: Still creating... [20s elapsed]
module.en.google_project_service.services["identitytoolkit.googleapis.com"]: Still creating... [20s elapsed]
module.en.google_project_service.services["cloudresourcemanager.googleapis.com"]: Still creating... [10s elapsed]
module.en.google_project_service.services["vpcaccess.googleapis.com"]: Still creating... [30s elapsed]
module.en.google_project_service.services["cloudkms.googleapis.com"]: Still creating... [30s elapsed]
module.en.google_project_service.services["servicenetworking.googleapis.com"]: Still creating... [30s elapsed]
module.en.google_project_service.services["sqladmin.googleapis.com"]: Still creating... [30s elapsed]
module.en.google_project_service.services["containerregistry.googleapis.com"]: Still creating... [30s elapsed]
module.en.google_project_service.services["iam.googleapis.com"]: Still creating... [30s elapsed]
module.en.google_project_service.services["secretmanager.googleapis.com"]: Still creating... [30s elapsed]
module.en.google_project_service.services["cloudidentity.googleapis.com"]: Still creating... [30s elapsed]
module.en.google_project_service.services["identitytoolkit.googleapis.com"]: Still creating... [30s elapsed]
module.en.google_project_service.services["cloudresourcemanager.googleapis.com"]: Still creating... [20s elapsed]
module.en.google_project_service.services["cloudresourcemanager.googleapis.com"]: Creation complete after 23s [id=cw-en-verification-9/cloudresourcemanager.googleapis.com]
module.en.google_project_service.services["cloudbuild.googleapis.com"]: Creating...
module.en.google_project_service.services["servicenetworking.googleapis.com"]: Still creating... [40s elapsed]
module.en.google_project_service.services["containerregistry.googleapis.com"]: Still creating... [40s elapsed]
module.en.google_project_service.services["vpcaccess.googleapis.com"]: Still creating... [40s elapsed]
module.en.google_project_service.services["cloudkms.googleapis.com"]: Still creating... [40s elapsed]
module.en.google_project_service.services["sqladmin.googleapis.com"]: Still creating... [40s elapsed]
module.en.google_project_service.services["iam.googleapis.com"]: Still creating... [40s elapsed]
module.en.google_project_service.services["secretmanager.googleapis.com"]: Still creating... [40s elapsed]
module.en.google_project_service.services["cloudidentity.googleapis.com"]: Still creating... [40s elapsed]
module.en.google_project_service.services["identitytoolkit.googleapis.com"]: Still creating... [40s elapsed]
module.en.google_project_service.services["run.googleapis.com"]: Creating...
module.en.google_project_service.services["containerregistry.googleapis.com"]: Still creating... [50s elapsed]
module.en.google_project_service.services["servicenetworking.googleapis.com"]: Still creating... [50s elapsed]
module.en.google_project_service.services["cloudkms.googleapis.com"]: Still creating... [50s elapsed]
module.en.google_project_service.services["iam.googleapis.com"]: Still creating... [50s elapsed]
module.en.google_project_service.services["vpcaccess.googleapis.com"]: Still creating... [50s elapsed]
module.en.google_project_service.services["sqladmin.googleapis.com"]: Still creating... [50s elapsed]
module.en.google_project_service.services["cloudidentity.googleapis.com"]: Still creating... [50s elapsed]
module.en.google_project_service.services["secretmanager.googleapis.com"]: Still creating... [50s elapsed]
module.en.google_project_service.services["identitytoolkit.googleapis.com"]: Still creating... [50s elapsed]
module.en.google_project_service.services["compute.googleapis.com"]: Creating...
module.en.google_project_service.services["vpcaccess.googleapis.com"]: Still creating... [1m0s elapsed]
module.en.google_project_service.services["iam.googleapis.com"]: Still creating... [1m0s elapsed]
module.en.google_project_service.services["sqladmin.googleapis.com"]: Still creating... [1m0s elapsed]
module.en.google_project_service.services["cloudkms.googleapis.com"]: Still creating... [1m0s elapsed]
module.en.google_project_service.services["servicenetworking.googleapis.com"]: Still creating... [1m0s elapsed]
module.en.google_project_service.services["containerregistry.googleapis.com"]: Still creating... [1m0s elapsed]
module.en.google_project_service.services["cloudidentity.googleapis.com"]: Still creating... [1m0s elapsed]
module.en.google_project_service.services["secretmanager.googleapis.com"]: Still creating... [1m0s elapsed]
module.en.google_project_service.services["identitytoolkit.googleapis.com"]: Still creating... [1m0s elapsed]
module.en.google_project_service.services["compute.googleapis.com"]: Still creating... [10s elapsed]
module.en.google_project_service.services["servicenetworking.googleapis.com"]: Still creating... [1m10s elapsed]
module.en.google_project_service.services["containerregistry.googleapis.com"]: Still creating... [1m10s elapsed]
module.en.google_project_service.services["iam.googleapis.com"]: Still creating... [1m10s elapsed]
module.en.google_project_service.services["sqladmin.googleapis.com"]: Still creating... [1m10s elapsed]
module.en.google_project_service.services["cloudkms.googleapis.com"]: Still creating... [1m10s elapsed]
module.en.google_project_service.services["vpcaccess.googleapis.com"]: Still creating... [1m10s elapsed]
module.en.google_project_service.services["secretmanager.googleapis.com"]: Still creating... [1m10s elapsed]
module.en.google_project_service.services["cloudidentity.googleapis.com"]: Still creating... [1m10s elapsed]
module.en.google_project_service.services["identitytoolkit.googleapis.com"]: Still creating... [1m10s elapsed]
module.en.google_project_service.services["compute.googleapis.com"]: Still creating... [20s elapsed]
module.en.google_project_service.services["iam.googleapis.com"]: Still creating... [1m20s elapsed]
module.en.google_project_service.services["containerregistry.googleapis.com"]: Still creating... [1m20s elapsed]
module.en.google_project_service.services["cloudkms.googleapis.com"]: Still creating... [1m20s elapsed]
module.en.google_project_service.services["sqladmin.googleapis.com"]: Still creating... [1m20s elapsed]
module.en.google_project_service.services["vpcaccess.googleapis.com"]: Still creating... [1m20s elapsed]
module.en.google_project_service.services["servicenetworking.googleapis.com"]: Still creating... [1m20s elapsed]
module.en.google_project_service.services["secretmanager.googleapis.com"]: Still creating... [1m20s elapsed]
module.en.google_project_service.services["cloudidentity.googleapis.com"]: Still creating... [1m20s elapsed]
module.en.google_project_service.services["identitytoolkit.googleapis.com"]: Still creating... [1m20s elapsed]
module.en.google_project_service.services["compute.googleapis.com"]: Still creating... [30s elapsed]
module.en.google_project_service.services["compute.googleapis.com"]: Creation complete after 33s [id=cw-en-verification-9/compute.googleapis.com]
module.en.google_project_service.services["secretmanager.googleapis.com"]: Creation complete after 1m25s [id=cw-en-verification-9/secretmanager.googleapis.com]
module.en.google_project_service.services["cloudkms.googleapis.com"]: Creation complete after 1m26s [id=cw-en-verification-9/cloudkms.googleapis.com]
module.en.google_project_service.services["cloudidentity.googleapis.com"]: Creation complete after 1m25s [id=cw-en-verification-9/cloudidentity.googleapis.com]
module.en.google_project_service.services["containerregistry.googleapis.com"]: Creation complete after 1m26s [id=cw-en-verification-9/containerregistry.googleapis.com]
module.en.google_project_service.services["identitytoolkit.googleapis.com"]: Creation complete after 1m24s [id=cw-en-verification-9/identitytoolkit.googleapis.com]
module.en.google_project_service.services["servicenetworking.googleapis.com"]: Creation complete after 1m26s [id=cw-en-verification-9/servicenetworking.googleapis.com]
module.en.google_project_service.services["vpcaccess.googleapis.com"]: Creation complete after 1m26s [id=cw-en-verification-9/vpcaccess.googleapis.com]
module.en.google_project_service.services["sqladmin.googleapis.com"]: Creation complete after 1m26s [id=cw-en-verification-9/sqladmin.googleapis.com]
module.en.google_project_service.services["iam.googleapis.com"]: Creation complete after 1m26s [id=cw-en-verification-9/iam.googleapis.com]
module.en.google_project_service.services["redis.googleapis.com"]: Creating...
module.en.google_project_service.services["sql-component.googleapis.com"]: Creating...
module.en.google_project_service.services["cloudscheduler.googleapis.com"]: Creating...
module.en.google_service_account.server: Creating...
module.en.google_service_account.e2e-runner-invoker: Creating...
module.en.google_project_service.services["firebase.googleapis.com"]: Creating...
module.en.google_project_iam_member.adminapi-observability["roles/cloudtrace.agent"]: Creating...
module.en.google_service_account.cleanup: Creating...
module.en.google_project_iam_member.adminapi-observability["roles/logging.logWriter"]: Creating...
module.en.google_project_iam_member.adminapi-observability["roles/stackdriver.resourceMetadata.writer"]: Creating...
module.en.google_service_account.cleanup: Creation complete after 1s [id=projects/cw-en-verification-9/serviceAccounts/en-verification-cleanup-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_service_account.server: Creation complete after 1s [id=projects/cw-en-verification-9/serviceAccounts/en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.adminapi-observability["roles/monitoring.metricWriter"]: Creating...
module.en.google_project_iam_member.e2e-runner-observability["roles/stackdriver.resourceMetadata.writer"]: Creating...
module.en.google_service_account.e2e-runner-invoker: Creation complete after 1s [id=projects/cw-en-verification-9/serviceAccounts/en-e2e-runner-invoker-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.e2e-runner-observability["roles/logging.logWriter"]: Creating...
module.en.google_project_service.services["sql-component.googleapis.com"]: Creation complete after 3s [id=cw-en-verification-9/sql-component.googleapis.com]
module.en.google_project_iam_member.e2e-runner-observability["roles/monitoring.metricWriter"]: Creating...
module.en.google_project_iam_member.e2e-runner-observability["roles/logging.logWriter"]: Creation complete after 7s [id=cw-en-verification-9/roles/logging.logWriter/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.e2e-runner-observability["roles/cloudtrace.agent"]: Creating...
module.en.google_project_iam_member.adminapi-observability["roles/logging.logWriter"]: Still creating... [10s elapsed]
module.en.google_project_iam_member.adminapi-observability["roles/cloudtrace.agent"]: Still creating... [10s elapsed]
module.en.google_project_service.services["firebase.googleapis.com"]: Still creating... [10s elapsed]
module.en.google_project_service.services["cloudscheduler.googleapis.com"]: Still creating... [10s elapsed]
module.en.google_project_iam_member.adminapi-observability["roles/stackdriver.resourceMetadata.writer"]: Still creating... [10s elapsed]
module.en.google_project_service.services["redis.googleapis.com"]: Still creating... [10s elapsed]
module.en.google_project_iam_member.adminapi-observability["roles/monitoring.metricWriter"]: Still creating... [10s elapsed]
module.en.google_project_iam_member.e2e-runner-observability["roles/stackdriver.resourceMetadata.writer"]: Still creating... [10s elapsed]
module.en.google_project_iam_member.e2e-runner-observability["roles/monitoring.metricWriter"]: Still creating... [10s elapsed]
module.en.google_project_iam_member.e2e-runner-observability["roles/cloudtrace.agent"]: Still creating... [10s elapsed]
module.en.google_project_iam_member.adminapi-observability["roles/logging.logWriter"]: Creation complete after 18s [id=cw-en-verification-9/roles/logging.logWriter/serviceaccount:en-verification-adminapi-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_compute_url_map.urlmap-http: Creating...
module.en.google_project_iam_member.adminapi-observability["roles/stackdriver.resourceMetadata.writer"]: Creation complete after 19s [id=cw-en-verification-9/roles/stackdriver.resourceMetadata.writer/serviceaccount:en-verification-adminapi-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret.db-secret["sslrootcert"]: Creating...
module.en.google_project_iam_member.adminapi-observability["roles/monitoring.metricWriter"]: Creation complete after 18s [id=cw-en-verification-9/roles/monitoring.metricWriter/serviceaccount:en-verification-adminapi-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret.cookie-hmac-key: Creating...
module.en.google_project_iam_member.e2e-runner-observability["roles/stackdriver.resourceMetadata.writer"]: Creation complete after 18s [id=cw-en-verification-9/roles/stackdriver.resourceMetadata.writer/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret.db-apikey-sig-hmac: Creating...
module.en.google_secret_manager_secret.db-secret["sslrootcert"]: Creation complete after 0s [id=projects/cw-en-verification-9/secrets/db-sslrootcert]
module.en.google_secret_manager_secret.db-verification-code-hmac: Creating...
module.en.google_project_service.services["redis.googleapis.com"]: Still creating... [20s elapsed]
module.en.google_project_iam_member.adminapi-observability["roles/cloudtrace.agent"]: Still creating... [20s elapsed]
module.en.google_project_service.services["firebase.googleapis.com"]: Still creating... [20s elapsed]
module.en.google_project_service.services["cloudscheduler.googleapis.com"]: Still creating... [20s elapsed]
module.en.google_secret_manager_secret.cookie-hmac-key: Creation complete after 1s [id=projects/cw-en-verification-9/secrets/cookie-hmac-key]
module.en.google_compute_global_address.private_ip_address: Creating...
module.en.google_project_iam_member.adminapi-observability["roles/cloudtrace.agent"]: Creation complete after 20s [id=cw-en-verification-9/roles/cloudtrace.agent/serviceaccount:en-verification-adminapi-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret.cache-hmac-key: Creating...
module.en.google_secret_manager_secret.db-apikey-sig-hmac: Creation complete after 1s [id=projects/cw-en-verification-9/secrets/db-apikey-sig-hmac]
module.en.google_secret_manager_secret.csrf-token: Creating...
module.en.google_secret_manager_secret.db-verification-code-hmac: Creation complete after 1s [id=projects/cw-en-verification-9/secrets/db-verification-code-hmac]
module.en.google_secret_manager_secret.db-secret["sslcert"]: Creating...
module.en.google_secret_manager_secret.cache-hmac-key: Creation complete after 0s [id=projects/cw-en-verification-9/secrets/cache-hmac-key]
module.en.google_secret_manager_secret.cookie-encryption-key: Creating...
module.en.google_secret_manager_secret.csrf-token: Creation complete after 1s [id=projects/cw-en-verification-9/secrets/csrf-token]
module.en.google_secret_manager_secret.db-apikey-db-hmac: Creating...
module.en.google_secret_manager_secret.db-secret["sslcert"]: Creation complete after 1s [id=projects/cw-en-verification-9/secrets/db-sslcert]
module.en.google_secret_manager_secret.db-secret["sslkey"]: Creating...
module.en.google_secret_manager_secret.cookie-encryption-key: Creation complete after 1s [id=projects/cw-en-verification-9/secrets/cookie-encryption-key]
module.en.google_secret_manager_secret.db-secret["password"]: Creating...
module.en.google_secret_manager_secret.db-apikey-db-hmac: Creation complete after 0s [id=projects/cw-en-verification-9/secrets/db-apikey-db-hmac]
module.en.google_kms_key_ring.verification: Creating...
module.en.google_secret_manager_secret.db-secret["sslkey"]: Creation complete after 0s [id=projects/cw-en-verification-9/secrets/db-sslkey]
module.en.google_vpc_access_connector.connector: Creating...
module.en.google_secret_manager_secret.db-secret["password"]: Creation complete after 1s [id=projects/cw-en-verification-9/secrets/db-password]
module.en.google_service_account.apiserver: Creating...
module.en.google_kms_key_ring.verification: Creation complete after 1s [id=projects/cw-en-verification-9/locations/us-central1/keyRings/verification]
module.en.google_project_iam_member.cleanup-observability["roles/cloudtrace.agent"]: Creating...
module.en.google_service_account.apiserver: Creation complete after 1s [id=projects/cw-en-verification-9/serviceAccounts/en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.cleanup-observability["roles/monitoring.metricWriter"]: Creating...
module.en.google_project_iam_member.e2e-runner-observability["roles/monitoring.metricWriter"]: Still creating... [20s elapsed]
module.en.google_project_iam_member.e2e-runner-observability["roles/monitoring.metricWriter"]: Creation complete after 22s [id=cw-en-verification-9/roles/monitoring.metricWriter/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.cleanup-observability["roles/stackdriver.resourceMetadata.writer"]: Creating...
module.en.google_project_iam_member.e2e-runner-observability["roles/cloudtrace.agent"]: Creation complete after 17s [id=cw-en-verification-9/roles/cloudtrace.agent/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.cleanup-observability["roles/logging.logWriter"]: Creating...
module.en.google_compute_url_map.urlmap-http: Still creating... [10s elapsed]
module.en.google_project_service.services["redis.googleapis.com"]: Still creating... [30s elapsed]
module.en.google_project_service.services["cloudscheduler.googleapis.com"]: Still creating... [30s elapsed]
module.en.google_project_service.services["firebase.googleapis.com"]: Still creating... [30s elapsed]
module.en.google_compute_global_address.private_ip_address: Still creating... [10s elapsed]
module.en.google_project_iam_member.cleanup-observability["roles/stackdriver.resourceMetadata.writer"]: Creation complete after 5s [id=cw-en-verification-9/roles/stackdriver.resourceMetadata.writer/serviceaccount:en-verification-cleanup-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.server-observability["roles/cloudtrace.agent"]: Creating...
module.en.google_compute_url_map.urlmap-http: Creation complete after 13s [id=projects/cw-en-verification-9/global/urlMaps/https-redirect]
module.en.google_project_iam_member.server-observability["roles/logging.logWriter"]: Creating...
module.en.google_vpc_access_connector.connector: Still creating... [10s elapsed]
module.en.google_compute_global_address.private_ip_address: Creation complete after 11s [id=projects/cw-en-verification-9/global/addresses/private-ip-address]
module.en.google_project_iam_member.server-observability["roles/monitoring.metricWriter"]: Creating...
module.en.google_project_iam_member.cleanup-observability["roles/cloudtrace.agent"]: Still creating... [10s elapsed]
module.en.google_project_service.services["firebase.googleapis.com"]: Creation complete after 33s [id=cw-en-verification-9/firebase.googleapis.com]
module.en.google_project_service.services["redis.googleapis.com"]: Creation complete after 33s [id=cw-en-verification-9/redis.googleapis.com]
module.en.google_project_service.services["cloudscheduler.googleapis.com"]: Creation complete after 33s [id=cw-en-verification-9/cloudscheduler.googleapis.com]
module.en.google_project_iam_member.firebase-admin: Creating...
module.en.google_project_iam_member.server-observability["roles/stackdriver.resourceMetadata.writer"]: Creating...
module.en.google_secret_manager_secret_version.cookie-hmac-key-version: Creating...
module.en.google_project_iam_member.cleanup-observability["roles/monitoring.metricWriter"]: Still creating... [10s elapsed]
module.en.google_secret_manager_secret_version.cookie-hmac-key-version: Creation complete after 1s [id=projects/295454028483/secrets/cookie-hmac-key/versions/1]
module.en.google_secret_manager_secret_iam_member.server-cookie-hmac-key: Creating...
module.en.google_project_iam_member.cleanup-observability["roles/logging.logWriter"]: Still creating... [10s elapsed]
module.en.google_project_iam_member.cleanup-observability["roles/cloudtrace.agent"]: Creation complete after 14s [id=cw-en-verification-9/roles/cloudtrace.agent/serviceaccount:en-verification-cleanup-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.e2e-runner-db-apikey-sig-hmac: Creating...
module.en.google_project_iam_member.cleanup-observability["roles/monitoring.metricWriter"]: Creation complete after 13s [id=cw-en-verification-9/roles/monitoring.metricWriter/serviceaccount:en-verification-cleanup-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.server-db-apikey-sig-hmac: Creating...
module.en.google_secret_manager_secret_iam_member.server-cookie-hmac-key: Creation complete after 5s [id=projects/cw-en-verification-9/secrets/cookie-hmac-key/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.cleanup-db-apikey-sig-hmac: Creating...
module.en.google_project_iam_member.server-observability["roles/cloudtrace.agent"]: Still creating... [10s elapsed]
module.en.google_project_iam_member.server-observability["roles/logging.logWriter"]: Still creating... [10s elapsed]
module.en.google_vpc_access_connector.connector: Still creating... [20s elapsed]
module.en.google_project_iam_member.server-observability["roles/monitoring.metricWriter"]: Still creating... [10s elapsed]
module.en.google_project_iam_member.cleanup-observability["roles/logging.logWriter"]: Creation complete after 17s [id=cw-en-verification-9/roles/logging.logWriter/serviceaccount:en-verification-cleanup-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_version.db-apikey-sig-hmac: Creating...
module.en.google_project_iam_member.server-observability["roles/stackdriver.resourceMetadata.writer"]: Creation complete after 9s [id=cw-en-verification-9/roles/stackdriver.resourceMetadata.writer/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.adminapi-db-apikey-sig-hmac: Creating...
module.en.google_project_iam_member.server-observability["roles/logging.logWriter"]: Creation complete after 11s [id=cw-en-verification-9/roles/logging.logWriter/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.adminapi-db-verification-code-hmac: Creating...
module.en.google_project_iam_member.server-observability["roles/cloudtrace.agent"]: Creation complete after 12s [id=cw-en-verification-9/roles/cloudtrace.agent/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_version.db-verification-code-hmac: Creating...
module.en.google_project_iam_member.firebase-admin: Still creating... [10s elapsed]
module.en.google_project_iam_member.server-observability["roles/monitoring.metricWriter"]: Creation complete after 12s [id=cw-en-verification-9/roles/monitoring.metricWriter/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.cleanup-db-verification-code-hmac: Creating...
module.en.google_project_iam_member.firebase-admin: Creation complete after 10s [id=cw-en-verification-9/roles/firebaseauth.admin/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.server-db-verification-code-hmac: Creating...
module.en.google_secret_manager_secret_version.db-apikey-sig-hmac: Creation complete after 1s [id=projects/295454028483/secrets/db-apikey-sig-hmac/versions/1]
module.en.google_secret_manager_secret_iam_member.e2e-runner-db-verification-code-hmac: Creating...
module.en.google_secret_manager_secret_version.db-verification-code-hmac: Creation complete after 2s [id=projects/295454028483/secrets/db-verification-code-hmac/versions/1]
module.en.google_secret_manager_secret_version.cache-hmac-key: Creating...
module.en.google_secret_manager_secret_version.cache-hmac-key: Creation complete after 1s [id=projects/295454028483/secrets/cache-hmac-key/versions/1]
module.en.google_secret_manager_secret_iam_member.server-csrf: Creating...
module.en.google_secret_manager_secret_iam_member.e2e-runner-db-apikey-sig-hmac: Still creating... [10s elapsed]
module.en.google_secret_manager_secret_iam_member.server-db-apikey-sig-hmac: Still creating... [10s elapsed]
module.en.google_secret_manager_secret_iam_member.cleanup-db-apikey-sig-hmac: Still creating... [10s elapsed]
module.en.google_secret_manager_secret_iam_member.e2e-runner-db-apikey-sig-hmac: Creation complete after 14s [id=projects/cw-en-verification-9/secrets/db-apikey-sig-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.server-csrf: Creation complete after 5s [id=projects/cw-en-verification-9/secrets/csrf-token/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_version.csrf-token-version: Creating...
module.en.google_secret_manager_secret_version.cookie-encryption-key-version: Creating...
module.en.google_vpc_access_connector.connector: Still creating... [30s elapsed]
module.en.google_secret_manager_secret_version.cookie-encryption-key-version: Creation complete after 2s [id=projects/295454028483/secrets/cookie-encryption-key/versions/1]
module.en.google_secret_manager_secret_iam_member.server-cookie-encryption-key: Creating...
module.en.google_secret_manager_secret_version.csrf-token-version: Creation complete after 2s [id=projects/295454028483/secrets/csrf-token/versions/1]
module.en.google_secret_manager_secret_iam_member.cleanup-db-apikey-db-hmac: Creating...
module.en.google_secret_manager_secret_iam_member.adminapi-db-apikey-sig-hmac: Still creating... [10s elapsed]
module.en.google_secret_manager_secret_iam_member.adminapi-db-verification-code-hmac: Still creating... [10s elapsed]
module.en.google_secret_manager_secret_iam_member.cleanup-db-verification-code-hmac: Still creating... [10s elapsed]
module.en.google_secret_manager_secret_iam_member.server-db-verification-code-hmac: Still creating... [10s elapsed]
module.en.google_secret_manager_secret_iam_member.e2e-runner-db-verification-code-hmac: Still creating... [10s elapsed]
module.en.google_secret_manager_secret_iam_member.server-db-apikey-sig-hmac: Creation complete after 19s [id=projects/cw-en-verification-9/secrets/db-apikey-sig-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.server-db-apikey-db-hmac: Creating...
module.en.google_secret_manager_secret_iam_member.cleanup-db-apikey-sig-hmac: Creation complete after 17s [id=projects/cw-en-verification-9/secrets/db-apikey-sig-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-cleanup-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.e2e-runner-db-apikey-db-hmac: Creating...
module.en.google_secret_manager_secret_iam_member.adminapi-db-apikey-sig-hmac: Creation complete after 14s [id=projects/cw-en-verification-9/secrets/db-apikey-sig-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-adminapi-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_version.db-apikey-db-hmac: Creating...
module.en.google_secret_manager_secret_iam_member.server-db-verification-code-hmac: Creation complete after 14s [id=projects/cw-en-verification-9/secrets/db-verification-code-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.server-cookie-encryption-key: Creation complete after 5s [id=projects/cw-en-verification-9/secrets/cookie-encryption-key/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.adminapi-db-apikey-db-hmac: Creating...
module.en.google_secret_manager_secret_iam_member.cleanup-db["sslkey"]: Creating...
module.en.google_secret_manager_secret_version.db-apikey-db-hmac: Creation complete after 1s [id=projects/295454028483/secrets/db-apikey-db-hmac/versions/1]
module.en.google_secret_manager_secret_iam_member.e2e-runner-db["password"]: Creating...
module.en.google_vpc_access_connector.connector: Still creating... [40s elapsed]
module.en.google_secret_manager_secret_iam_member.adminapi-db-verification-code-hmac: Creation complete after 20s [id=projects/cw-en-verification-9/secrets/db-verification-code-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-adminapi-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.cleanup-db["sslkey"]: Creation complete after 5s [id=projects/cw-en-verification-9/secrets/db-sslkey/roles/secretmanager.secretAccessor/serviceaccount:en-verification-cleanup-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.e2e-runner-db["sslkey"]: Creating...
module.en.google_secret_manager_secret_iam_member.e2e-runner-db["sslrootcert"]: Creating...
module.en.google_secret_manager_secret_iam_member.cleanup-db-apikey-db-hmac: Still creating... [10s elapsed]
module.en.google_secret_manager_secret_iam_member.e2e-runner-db["password"]: Creation complete after 5s [id=projects/cw-en-verification-9/secrets/db-password/roles/secretmanager.secretAccessor/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.cleanup-db-verification-code-hmac: Creation complete after 19s [id=projects/cw-en-verification-9/secrets/db-verification-code-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-cleanup-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.adminapi-db["sslrootcert"]: Creating...
module.en.google_secret_manager_secret_iam_member.adminapi-db["sslcert"]: Creating...
module.en.google_secret_manager_secret_iam_member.e2e-runner-db-verification-code-hmac: Creation complete after 19s [id=projects/cw-en-verification-9/secrets/db-verification-code-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.adminapi-db["password"]: Creating...
module.en.google_secret_manager_secret_iam_member.server-db-apikey-db-hmac: Still creating... [10s elapsed]
module.en.google_secret_manager_secret_iam_member.e2e-runner-db-apikey-db-hmac: Still creating... [10s elapsed]
module.en.google_secret_manager_secret_iam_member.cleanup-db-apikey-db-hmac: Creation complete after 14s [id=projects/cw-en-verification-9/secrets/db-apikey-db-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-cleanup-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.adminapi-db["sslkey"]: Creating...
module.en.google_secret_manager_secret_iam_member.adminapi-db-apikey-db-hmac: Still creating... [10s elapsed]
module.en.google_secret_manager_secret_iam_member.adminapi-db["sslcert"]: Creation complete after 5s [id=projects/cw-en-verification-9/secrets/db-sslcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-adminapi-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.cleanup-db["password"]: Creating...
module.en.google_secret_manager_secret_iam_member.adminapi-db["password"]: Creation complete after 5s [id=projects/cw-en-verification-9/secrets/db-password/roles/secretmanager.secretAccessor/serviceaccount:en-verification-adminapi-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.server-db["password"]: Creating...
module.en.google_secret_manager_secret_iam_member.server-db-apikey-db-hmac: Creation complete after 16s [id=projects/cw-en-verification-9/secrets/db-apikey-db-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.server-db["sslkey"]: Creating...
module.en.google_secret_manager_secret_iam_member.e2e-runner-db-apikey-db-hmac: Creation complete after 15s [id=projects/cw-en-verification-9/secrets/db-apikey-db-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.cleanup-db["sslrootcert"]: Creating...
module.en.google_secret_manager_secret_iam_member.e2e-runner-db["sslkey"]: Creation complete after 9s [id=projects/cw-en-verification-9/secrets/db-sslkey/roles/secretmanager.secretAccessor/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.adminapi-db-apikey-db-hmac: Creation complete after 14s [id=projects/cw-en-verification-9/secrets/db-apikey-db-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-adminapi-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.server-db["sslcert"]: Creating...
module.en.google_secret_manager_secret_iam_member.e2e-runner-db["sslcert"]: Creating...
module.en.google_secret_manager_secret_iam_member.e2e-runner-db["sslrootcert"]: Creation complete after 9s [id=projects/cw-en-verification-9/secrets/db-sslrootcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.cleanup-db["sslcert"]: Creating...
module.en.google_vpc_access_connector.connector: Still creating... [50s elapsed]
module.en.google_secret_manager_secret_iam_member.adminapi-db["sslrootcert"]: Still creating... [10s elapsed]
module.en.google_secret_manager_secret_iam_member.adminapi-db["sslkey"]: Still creating... [10s elapsed]
module.en.google_secret_manager_secret_iam_member.adminapi-db["sslkey"]: Creation complete after 10s [id=projects/cw-en-verification-9/secrets/db-sslkey/roles/secretmanager.secretAccessor/serviceaccount:en-verification-adminapi-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.adminapi-db["sslrootcert"]: Creation complete after 14s [id=projects/cw-en-verification-9/secrets/db-sslrootcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-adminapi-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.server-db["sslrootcert"]: Creating...
module.en.google_kms_crypto_key.token-signer: Creating...
module.en.google_secret_manager_secret_iam_member.server-db["sslkey"]: Creation complete after 5s [id=projects/cw-en-verification-9/secrets/db-sslkey/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.cleanup-db["sslrootcert"]: Creation complete after 5s [id=projects/cw-en-verification-9/secrets/db-sslrootcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-cleanup-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.cleanup-db["password"]: Creation complete after 9s [id=projects/cw-en-verification-9/secrets/db-password/roles/secretmanager.secretAccessor/serviceaccount:en-verification-cleanup-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_kms_key_ring_iam_member.server-verification-key-admin: Creating...
module.en.google_kms_key_ring_iam_member.server-verification-key-signer-verifier: Creating...
module.en.google_kms_crypto_key.certificate-signer: Creating...
module.en.google_kms_crypto_key.token-signer: Creation complete after 1s [id=projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/token-signer]
module.en.google_kms_crypto_key.database-encrypter: Creating...
module.en.google_secret_manager_secret_iam_member.server-db["password"]: Creation complete after 10s [id=projects/cw-en-verification-9/secrets/db-password/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.apiserver-db-verification-code-hmac: Creating...
module.en.google_kms_crypto_key.certificate-signer: Creation complete after 1s [id=projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/certificate-signer]
module.en.google_project_iam_member.apiserver-observability["roles/monitoring.metricWriter"]: Creating...
module.en.google_kms_crypto_key.database-encrypter: Creation complete after 0s [id=projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter]
module.en.google_secret_manager_secret_iam_member.apiserver-db-apikey-db-hmac: Creating...
module.en.google_secret_manager_secret_iam_member.server-db["sslrootcert"]: Creation complete after 5s [id=projects/cw-en-verification-9/secrets/db-sslrootcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.apiserver-db["sslcert"]: Creating...
module.en.google_secret_manager_secret_iam_member.e2e-runner-db["sslcert"]: Still creating... [10s elapsed]
module.en.google_secret_manager_secret_iam_member.server-db["sslcert"]: Still creating... [10s elapsed]
module.en.google_secret_manager_secret_iam_member.cleanup-db["sslcert"]: Still creating... [10s elapsed]
module.en.google_vpc_access_connector.connector: Still creating... [1m0s elapsed]
module.en.google_secret_manager_secret_iam_member.apiserver-db-verification-code-hmac: Creation complete after 5s [id=projects/cw-en-verification-9/secrets/db-verification-code-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_kms_key_ring_iam_member.kms-signerverifier: Creating...
module.en.google_secret_manager_secret_iam_member.apiserver-db-apikey-db-hmac: Creation complete after 5s [id=projects/cw-en-verification-9/secrets/db-apikey-db-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.apiserver-db["sslkey"]: Creating...
module.en.google_project_iam_member.apiserver-observability["roles/monitoring.metricWriter"]: Creation complete after 8s [id=cw-en-verification-9/roles/monitoring.metricWriter/serviceaccount:en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.apiserver-db-apikey-sig-hmac: Creating...
module.en.google_secret_manager_secret_iam_member.server-db["sslcert"]: Creation complete after 14s [id=projects/cw-en-verification-9/secrets/db-sslcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.apiserver-observability["roles/logging.logWriter"]: Creating...
module.en.google_secret_manager_secret_iam_member.e2e-runner-db["sslcert"]: Creation complete after 14s [id=projects/cw-en-verification-9/secrets/db-sslcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.apiserver-observability["roles/cloudtrace.agent"]: Creating...
module.en.google_kms_key_ring_iam_member.server-verification-key-admin: Creation complete after 10s [id=projects/cw-en-verification-9/locations/us-central1/keyRings/verification/roles/cloudkms.admin/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_project_iam_member.apiserver-observability["roles/stackdriver.resourceMetadata.writer"]: Creating...
module.en.google_kms_key_ring_iam_member.server-verification-key-signer-verifier: Still creating... [10s elapsed]
module.en.google_secret_manager_secret_iam_member.apiserver-db["sslkey"]: Creation complete after 5s [id=projects/cw-en-verification-9/secrets/db-sslkey/roles/secretmanager.secretAccessor/serviceaccount:en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.apiserver-db["password"]: Creating...
module.en.google_secret_manager_secret_iam_member.apiserver-db-apikey-sig-hmac: Creation complete after 5s [id=projects/cw-en-verification-9/secrets/db-apikey-sig-hmac/roles/secretmanager.secretAccessor/serviceaccount:en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.apiserver-db["sslrootcert"]: Creating...
module.en.google_secret_manager_secret_iam_member.cleanup-db["sslcert"]: Creation complete after 19s [id=projects/cw-en-verification-9/secrets/db-sslcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-cleanup-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_service_networking_connection.private_vpc_connection: Creating...
module.en.google_secret_manager_secret_iam_member.apiserver-db["sslcert"]: Creation complete after 9s [id=projects/cw-en-verification-9/secrets/db-sslcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_firebase_project.default: Creating...
module.en.google_kms_key_ring_iam_member.server-verification-key-signer-verifier: Creation complete after 15s [id=projects/cw-en-verification-9/locations/us-central1/keyRings/verification/roles/cloudkms.signerVerifier/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.data.google_kms_crypto_key_version.token-signer-version: Reading...
module.en.google_kms_key_ring_iam_member.kms-signerverifier: Creation complete after 9s [id=projects/cw-en-verification-9/locations/us-central1/keyRings/verification/roles/cloudkms.signerVerifier/serviceaccount:en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.data.google_kms_crypto_key_version.certificate-signer-version: Reading...
module.en.google_vpc_access_connector.connector: Still creating... [1m10s elapsed]
module.en.google_secret_manager_secret_iam_member.apiserver-db["password"]: Creation complete after 5s [id=projects/cw-en-verification-9/secrets/db-password/roles/secretmanager.secretAccessor/serviceaccount:en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_kms_crypto_key_iam_member.server-database-encrypter: Creating...
module.en.data.google_kms_crypto_key_version.token-signer-version: Read complete after 1s [id=//cloudkms.googleapis.com/v1/projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/token-signer/cryptoKeyVersions/1]
module.en.google_kms_crypto_key_iam_member.cleanup-database-encrypter: Creating...
module.en.data.google_kms_crypto_key_version.certificate-signer-version: Read complete after 1s [id=//cloudkms.googleapis.com/v1/projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/certificate-signer/cryptoKeyVersions/1]
module.en.google_kms_crypto_key_iam_member.adminapi-database-encrypter: Creating...
module.en.google_project_iam_member.apiserver-observability["roles/stackdriver.resourceMetadata.writer"]: Creation complete after 7s [id=cw-en-verification-9/roles/stackdriver.resourceMetadata.writer/serviceaccount:en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_kms_crypto_key_iam_member.e2e-runner-database-encrypter: Creating...
module.en.google_project_iam_member.apiserver-observability["roles/logging.logWriter"]: Creation complete after 9s [id=cw-en-verification-9/roles/logging.logWriter/serviceaccount:en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_kms_crypto_key_iam_member.apiserver-database-encrypter: Creating...
module.en.google_project_iam_member.apiserver-observability["roles/cloudtrace.agent"]: Creation complete after 9s [id=cw-en-verification-9/roles/cloudtrace.agent/serviceaccount:en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_secret_manager_secret_iam_member.apiserver-db["sslrootcert"]: Creation complete after 5s [id=projects/cw-en-verification-9/secrets/db-sslrootcert/roles/secretmanager.secretAccessor/serviceaccount:en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_service_networking_connection.private_vpc_connection: Still creating... [10s elapsed]
module.en.google_firebase_project.default: Still creating... [10s elapsed]
module.en.google_vpc_access_connector.connector: Still creating... [1m20s elapsed]
module.en.google_kms_crypto_key_iam_member.server-database-encrypter: Still creating... [10s elapsed]
module.en.google_kms_crypto_key_iam_member.cleanup-database-encrypter: Still creating... [10s elapsed]
module.en.google_kms_crypto_key_iam_member.adminapi-database-encrypter: Still creating... [10s elapsed]
module.en.google_kms_crypto_key_iam_member.e2e-runner-database-encrypter: Still creating... [10s elapsed]
module.en.google_kms_crypto_key_iam_member.apiserver-database-encrypter: Still creating... [10s elapsed]
module.en.google_service_networking_connection.private_vpc_connection: Still creating... [20s elapsed]
module.en.google_firebase_project.default: Still creating... [20s elapsed]
module.en.google_vpc_access_connector.connector: Still creating... [1m30s elapsed]
module.en.google_kms_crypto_key_iam_member.server-database-encrypter: Still creating... [20s elapsed]
module.en.google_kms_crypto_key_iam_member.cleanup-database-encrypter: Still creating... [20s elapsed]
module.en.google_kms_crypto_key_iam_member.adminapi-database-encrypter: Still creating... [20s elapsed]
module.en.google_firebase_project.default: Creation complete after 23s [id=projects/cw-en-verification-9]
module.en.google_firebase_web_app.default: Creating...
module.en.google_kms_crypto_key_iam_member.e2e-runner-database-encrypter: Still creating... [20s elapsed]
module.en.google_kms_crypto_key_iam_member.apiserver-database-encrypter: Still creating... [20s elapsed]
module.en.google_kms_crypto_key_iam_member.server-database-encrypter: Creation complete after 24s [id=projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceaccount:en-verification-server-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_kms_crypto_key_iam_member.cleanup-database-encrypter: Creation complete after 24s [id=projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceaccount:en-verification-cleanup-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_kms_crypto_key_iam_member.adminapi-database-encrypter: Creation complete after 24s [id=projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceaccount:en-verification-adminapi-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_kms_crypto_key_iam_member.e2e-runner-database-encrypter: Creation complete after 24s [id=projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceaccount:en-verification-e2e-runner-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_kms_crypto_key_iam_member.apiserver-database-encrypter: Creation complete after 23s [id=projects/cw-en-verification-9/locations/us-central1/keyRings/verification/cryptoKeys/database-encrypter/roles/cloudkms.cryptoKeyEncrypterDecrypter/serviceaccount:en-verification-apiserver-sa@cw-en-verification-9.iam.gserviceaccount.com]
module.en.google_service_networking_connection.private_vpc_connection: Still creating... [30s elapsed]
module.en.google_vpc_access_connector.connector: Still creating... [1m40s elapsed]
module.en.google_vpc_access_connector.connector: Creation complete after 1m42s [id=projects/cw-en-verification-9/locations/us-central1/connectors/serverless-vpc-connector]
module.en.google_firebase_web_app.default: Still creating... [10s elapsed]
module.en.google_firebase_web_app.default: Creation complete after 12s [id=projects/cw-en-verification-9/webApps/1:295454028483:web:1b7975c50d53469d016876]
module.en.data.google_firebase_web_app_config.default: Reading...
module.en.data.google_firebase_web_app_config.default: Read complete after 0s [id=1:295454028483:web:1b7975c50d53469d016876]
module.en.google_service_networking_connection.private_vpc_connection: Still creating... [40s elapsed]
module.en.google_service_networking_connection.private_vpc_connection: Still creating... [50s elapsed]
module.en.google_service_networking_connection.private_vpc_connection: Still creating... [1m0s elapsed]
module.en.google_service_networking_connection.private_vpc_connection: Still creating... [1m10s elapsed]
module.en.google_service_networking_connection.private_vpc_connection: Creation complete after 1m15s [id=projects%2Fcw-en-verification-9%2Fglobal%2Fnetworks%2Fdefault:servicenetworking.googleapis.com]
module.en.google_redis_instance.cache: Creating...
module.en.google_sql_database_instance.db-inst: Creating...
module.en.google_redis_instance.cache: Still creating... [10s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [10s elapsed]
module.en.google_redis_instance.cache: Still creating... [20s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [20s elapsed]
module.en.google_redis_instance.cache: Still creating... [30s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [30s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [40s elapsed]
module.en.google_redis_instance.cache: Still creating... [40s elapsed]
module.en.google_redis_instance.cache: Still creating... [50s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [50s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [1m0s elapsed]
module.en.google_redis_instance.cache: Still creating... [1m0s elapsed]
module.en.google_redis_instance.cache: Still creating... [1m10s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [1m10s elapsed]
module.en.google_redis_instance.cache: Still creating... [1m20s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [1m20s elapsed]
module.en.google_redis_instance.cache: Still creating... [1m30s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [1m30s elapsed]
module.en.google_redis_instance.cache: Still creating... [1m40s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [1m40s elapsed]
module.en.google_redis_instance.cache: Still creating... [1m50s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [1m50s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [2m0s elapsed]
module.en.google_redis_instance.cache: Still creating... [2m0s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [2m10s elapsed]
module.en.google_redis_instance.cache: Still creating... [2m10s elapsed]
module.en.google_redis_instance.cache: Still creating... [2m20s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [2m20s elapsed]
module.en.google_redis_instance.cache: Still creating... [2m30s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [2m30s elapsed]
module.en.google_redis_instance.cache: Still creating... [2m40s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [2m40s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [2m50s elapsed]
module.en.google_redis_instance.cache: Still creating... [2m50s elapsed]
module.en.google_redis_instance.cache: Still creating... [3m0s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [3m0s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [3m10s elapsed]
module.en.google_redis_instance.cache: Still creating... [3m10s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [3m20s elapsed]
module.en.google_redis_instance.cache: Still creating... [3m20s elapsed]
module.en.google_redis_instance.cache: Still creating... [3m30s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [3m30s elapsed]
module.en.google_redis_instance.cache: Still creating... [3m40s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [3m40s elapsed]
module.en.google_redis_instance.cache: Still creating... [3m50s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [3m50s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [4m0s elapsed]
module.en.google_redis_instance.cache: Still creating... [4m0s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [4m10s elapsed]
module.en.google_redis_instance.cache: Still creating... [4m10s elapsed]
module.en.google_redis_instance.cache: Still creating... [4m20s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [4m20s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [4m30s elapsed]
module.en.google_redis_instance.cache: Still creating... [4m30s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [4m40s elapsed]
module.en.google_redis_instance.cache: Still creating... [4m40s elapsed]
module.en.google_redis_instance.cache: Still creating... [4m50s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [4m50s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [5m0s elapsed]
module.en.google_redis_instance.cache: Still creating... [5m0s elapsed]
module.en.google_sql_database_instance.db-inst: Still creating... [5m10s elapsed]
module.en.google_redis_instance.cache: Still creating... [5m10s elapsed]
module.en.google_sql_database_instance.db-inst: Creation complete after 5m12s [id=en-verification]
module.en.google_sql_user.user: Creating...
module.en.google_sql_database.db: Creating...
module.en.google_sql_ssl_cert.db-cert: Creating...
module.en.google_sql_user.user: Creation complete after 3s [id=verification//en-verification]
module.en.google_sql_database.db: Creation complete after 7s [id=projects/cw-en-verification-9/instances/en-verification/databases/verification]
module.en.google_redis_instance.cache: Still creating... [5m20s elapsed]
module.en.google_sql_ssl_cert.db-cert: Still creating... [10s elapsed]
module.en.google_redis_instance.cache: Still creating... [5m30s elapsed]
module.en.google_sql_ssl_cert.db-cert: Still creating... [20s elapsed]
module.en.google_redis_instance.cache: Still creating... [5m40s elapsed]
module.en.google_redis_instance.cache: Creation complete after 5m40s [id=projects/cw-en-verification-9/locations/us-central1/instances/verification-cache]
module.en.google_sql_ssl_cert.db-cert: Still creating... [30s elapsed]
module.en.google_sql_ssl_cert.db-cert: Still creating... [40s elapsed]
module.en.google_sql_ssl_cert.db-cert: Creation complete after 44s [id=projects/cw-en-verification-9/instances/en-verification/sslCerts/0b52aefe01a28469d412de89b68aaa59d36a2f37]
module.en.google_secret_manager_secret_version.db-secret-version["sslkey"]: Creating...
module.en.google_secret_manager_secret_version.db-secret-version["sslcert"]: Creating...
module.en.google_secret_manager_secret_version.db-secret-version["sslrootcert"]: Creating...
module.en.google_secret_manager_secret_version.db-secret-version["password"]: Creating...
module.en.google_secret_manager_secret_version.db-secret-version["sslcert"]: Creation complete after 2s [id=projects/295454028483/secrets/db-sslcert/versions/1]
module.en.google_secret_manager_secret_version.db-secret-version["password"]: Creation complete after 2s [id=projects/295454028483/secrets/db-password/versions/1]
module.en.local_file.env[0]: Creating...
module.en.local_file.env[0]: Creation complete after 0s [id=757fcb2e0a9712052118988f93ec4490fbaadf99]
module.en.google_secret_manager_secret_version.db-secret-version["sslrootcert"]: Creation complete after 3s [id=projects/295454028483/secrets/db-sslrootcert/versions/1]
module.en.google_secret_manager_secret_version.db-secret-version["sslkey"]: Creation complete after 3s [id=projects/295454028483/secrets/db-sslkey/versions/1]

Error: Request "Enable Project Service \"cloudbuild.googleapis.com\" for project \"cw-en-verification-9\"" returned error: failed to send enable services request: googleapi: Error 400: Another activation or deactivation is in progress for the following service(s): cloudbuild.googleapis.com and project cw-en-verification-9., failedPrecondition

  on .terraform/modules/en/terraform/main.tf line 35, in resource "google_project_service" "services":
  35: resource "google_project_service" "services" {



Error: Request "Enable Project Service \"run.googleapis.com\" for project \"cw-en-verification-9\"" returned error: failed to send enable services request: googleapi: Error 400: Another activation or deactivation is in progress for the following service(s): run.googleapis.com and project cw-en-verification-9., failedPrecondition

  on .terraform/modules/en/terraform/main.tf line 35, in resource "google_project_service" "services":
  35: resource "google_project_service" "services" {


zsombor@MacBook-Pro cw-en-verification-9 % 
```